export const sanyaogua = {
  1: {
    name: "乾 卦",
    detail: "乾一 —— 乾为天：为父  为首  为马  为刚健",
    img: "1"
  },
  2: {
    name: "兑 卦",
    detail: "兑二 —— 兑为泽：为少女  为口  为羊  为喜悦（注意也有口舌是非）",
    img: "2"
  },
  3: {
    name: "离 卦",
    detail: "离三 —— 离为火：为中女  为眼  为雉  为附丽（依附）",
    img: "3"
  },
  4: {
    name: "震 卦",
    detail: "震四 —— 震为雷：为长男  为足  为龙  为行动",
    img: "4"
  },
  5: {
    name: "巽 卦",
    detail: "巽五 —— 巽为风：为长女  为股（大腿）  为鸡  为顺利",
    img: "5"
  },
  6: {
    name: "坎 卦",
    detail: "坎六 —— 坎为水：为中男  为耳  为猪  为坎陷",
    img: "6"
  },
  7: {
    name: "艮 卦",
    detail: "艮七 —— 艮为山：为少男  为手  为狗  为阻止",
    img: "7"
  },
  8: {
    name: "坤 卦",
    detail: "坤八 —— 坤为地：为母  为腹  为牛  为顺从",
    img: "8"
  }
};

export function getSygList(obj) {
  const a = Object.values(obj);
  return a;
}

export const liusigua = {
  // 1
  11: {
    name: "第1卦 乾：乾为天卦",
    img: "1",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表刚健不息，积极进取",
      "得此卦者需要柔顺者的辅佐",
      "乾的本意是刚健而又刚健，与柔顺相对立。得乾卦者，虽有创业的本领，但缺守成的功夫。因为性格阳刚而成事，也会因为阳刚而败事。身处逆境时可以是迎风的火把，进入顺境则容易忘乎所以。"
    ]
  },
  12: {
    name: "第10卦 履：天泽履卦",
    img: "10",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表躬身行事，有惊无险",
      "得此卦者应循规蹈矩",
      "履象征虽然踩了老虎尾巴却没有受到伤害，可以亨通。得履卦者虽然有惊无险，但应该遵照“礼”来行事，非礼勿动，非礼勿视，非礼勿听。量力而行，安守本分，不可一意孤行，逞强冒进，以避免不必要的摩擦和麻烦。"
    ]
  },
  13: {
    name: "第13卦  同人：天火同人卦",
    img: "13",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表齐心协力，广结社交",
      "得此卦者应融于众人",
      "同人象征团结众人才能有所收获。得同人卦者要善于借鸡下蛋，借助他人的力量成事。一个篱笆三根桩，一个好汉三个帮，大石头没有小石头垫脚就没有稳固的根基，能化敌为友才是干大事者的气度。"
    ]
  },
  14: {
    name: "第25卦 无妄：天雷无妄卦",
    img: "25",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表不可妄为，不可强行",
      "得此卦者不可有非分之想",
      "无妄就是不要有妄念。坚持正义则无往不胜，走向邪道则必然不利。得无妄卦者的客观条件不成熟，如果有妄念、妄动则会带来灾祸。如果循规蹈矩、只耕耘而不问收获、不作非分之想，就会相安无事。"
    ]
  },
  15: {
    name: "第44卦 姤：天风姤卦",
    img: "44",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表不期而遇，聚散不定",
      "得此卦者要学会推销自己",
      "姤指意外相遇。得姤卦者，碰到机遇才能有所为。此时，个人价值的实现与机遇有直接关系。要学习毛遂自荐，遇上识货之人才能获得撬动地球的支点。不过，有时这种相遇并不是好兆头，必要时要明智地退出。"
    ]
  },
  16: {
    name: "第6卦 讼：天水讼卦",
    img: "6",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表争执不下，要打官司",
      "得此卦者忍为上策",
      "讼既是争讼打官司，这对双方都不利，恃强争胜，结果必然凶险。得讼卦者大都面临纷争之事。麻烦来了，肯定不能算吉，此时应该以静制动，避免两败俱伤，尽量借助外力化解纷争。如果恃势欺人则会激化矛盾。"
    ]
  },
  17: {
    name: "第33卦 遁：天山遁卦",
    img: "33",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表隐遁躲避，以退为进",
      "得此卦者应看破功名利禄",
      "遁就是退避，但这不是因为胆小。韩信受胯下之辱却终成大事就是说明。得遁卦者，身退不如心退，如果心有不甘，身退便无意义。“大隐隐于朝，中隐隐于市，小隐隐于野。”英雄处于末路，要学会保护自己，留得青山在。"
    ]
  },
  18: {
    name: "第12卦 否：天地否卦",
    img: "12",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表闭塞变坏，万事隔绝",
      "得此卦者最忌自暴自弃",
      "否与泰相反，表示天地不通，万事隔绝，不吉到了极点。得否卦者凶，事倍功半，所得很少。在最黑暗时要学会居卑示弱，韬光养晦，积蓄力量，等待时机。冬天来了，春天便不远。一旦机遇出现，又是一个全新的我。"
    ]
  },
  // 2
  21: {
    name: "第43卦 夬：泽天夬卦",
    img: "43",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表果决除奸，要讲策略",
      "得此卦者不可优柔寡断",
      "夬就是决断，也象征清除小人。得夬卦者处在十字路口，不可在一棵树上吊死，不想决断也得做出决断。当断不断反受其乱，抗衡不了就应该变换思路，战略大转移。此时不可莽撞，要柔中带刚，有充分准备后再决断。"
    ]
  },
  22: {
    name: "第58卦 兑：兑为泽卦",
    img: "58",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: [
      "兑卦运势速断",
      "运势—六冲卦，不顺。两泽相依，令人怡悦，但有喜有忧。",
      "事业—善长人际关系，能团结他人，获得援助。应保持谦虚，不可过分自信。",
      "爱情—和悦，也会娇蛮、任性、斗嘴，不可意气用事，随和自律为吉。",
      "疾病—多为与女色或口舌有关之病，可治。但久病则难愈。宜往东南方求医。",
      "经商—改行、开业吉利。交易中可获利丰厚，但有反复之象。",
      "诉讼—不是大事，只是有来往是非，有人解说后会和解。",
      "出行—虽有失脱，一失一喜，有人同行则会有口舌。",
      "人生—善于文化工作和语言表达。性格灵动温和，柔美内秀。"
    ],
    chushizhidao: [
      "代表言语沟通，带来喜悦",
      "得此卦者应为悦己者容",
      "兑指流通滋润、因言语带来喜悦。此时应相互交流，彼此受益。得兑卦者，往往左右逢源、讨好卖乖，容易失去人格和灵魂。以言悦人多属阿谀，以貌悦人多为皮肉生意。所以要学会自重、自强与自立。"
    ]
  },
  23: {
    name: "第49卦 革：泽火革卦",
    img: "49",
    guayao: [
      "革，己日乃孚。元亨利贞，悔亡。",
      "上六：君子豹变，小人革面，征凶，居贞吉。",
      "九五：大人虎变，未占有孚。",
      "九四：悔亡，有孚改命，吉。",
      "九三：征凶，贞厉，革言三就，有孚。",
      "六二：己日乃革之，征吉，无咎。",
      "初九：巩用黄牛之革。"
    ],
    guayaoyi: [
      "革卦，己日得到诚信。大亨通而利于守正道，没有悔恨。",
      "上六：君子像豹子换毛一样改变自己，小人也换了新的面貌。征讨凶险，居守正道吉祥。",
      "九五：大人物像老虎换毛一样改变自己，不用占卜也会得到人们的信任。",
      "九四：没有悔恨，有信心改变旧的天命，吉祥。",
      "九三：征伐凶险，守正道危险，改革的命令已实现十分之三，初见成效，已取得了信任。",
      "六二：在己日进行大的变革，征讨吉祥，没有灾难。",
      "初九：用黄牛皮制成的绳子捆牢。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】革，己日乃孚。元亨利贞，悔亡。",
          "彖曰：革，水火相息，二女同居，其志不相得，曰革。己日乃孚；革而信也。文明以说，大亨以正。革而当，其悔乃亡。天地革而四时成，汤武革命，顺乎天而应乎人，革之时大矣哉！",
          "象曰：泽中有火，革。君子以治历明时。"
        ],
        [
          "【译文】革卦，己日得到诚信。大亨通而利于守正道，没有悔恨。",
          "彖辞说：革卦，水火不相容，两个女人住在一起，心愿与志向不同，这就是革卦。己日得到诚信，是通过变革取得人民的信任。内心光明而外表喜悦，大亨通于正道。改革适当，忧悔就会消失。天地变革才能形成四季，商汤革除了夏朝的天命，武王革除了商纣的天命，顺应天时与人心，革卦的时势意义太大了。",
          "象辞说：泽中有火就是革卦的卦象。君子从卦象中受到启示，制定历法以明确天时的变化。"
        ],
        [
          "【启示】“革”字是象形字，像被剖剥下来的兽皮。其引申义是变革、改革、革命。井水需要不断的清理、革新才能保持洁净，所以井卦的后面是革卦。革卦是个状况卦，吉凶未定。从卦象上看，泽中有火。泽中会有火山爆发，人们必须重新择地而居，这是大的社会变革。不变革就不会前进，变革是历史发展到一定时段的必然产物，代表新时代的开始。变革会转换原有势态，变革的时代会有大机遇，乱世造英雄。",
          "推行变革要克服相当大的阻力，甚至会出现一些不大不小的社会动荡。要成事，既要有“天时地利”的外在条件，又要有“人和”的内在条件。要想成功必须坚持两点：一要抓住时机，二要取信于人。变革旧的事物不是轻而易举的事情，需要一段时间的准备，才能逐渐被人们理解、接受。如果贸然变革，效果会适得其反。顽固的成见是极为可怕的。革卦的六个爻表示不同时位、不同特征、不同做法的变革，以及产生的不同结果。",
          "得此卦者，求财虽可成，但有小错而迟。预测婚姻，女克夫，并有急躁、破财之象，另觅配偶为吉。已婚者得此卦，有缘分破败、另起炉灶之象。"
        ]
      ],
      6: [
        "【原文】象曰：巩用黄牛，不可以有为也。",
        "【译文】象辞说：用黄牛皮制成的绳子捆牢，是不能认为这便是有所作为的。",
        "【启示】初九代表改革时的下层百姓，又代表改革的最初阶段。社会刚有大变革时，百姓还是不要参与为好，因为改革是否能够成功还不能肯定。所以百姓用黄牛皮的绳子把自己拴起来，不盲目参与。另一方面，对于实施改革的人来说，改革的初期如果时机不太成熟，最好也找根黄牛皮的绳子把自己拴结实。"
      ],
      5: [
        "【原文】象曰：己日革之，行有嘉也。",
        "【译文】象辞说：在己日进行改革，行动会有好处。",
        "【启示】具备了变革的主观条件，但还要把握变革的时机。旧的东西非革不可，已经到了亟须转变的时候，应抓住这个时机，否则将遗恨终生。不过，六二是阴柔之质，天生存有迟疑软弱的成分，瞻前顾后，不能果断行动。比如商汤讨伐夏桀时，便是根据诸侯已经背叛夏桀之后才进军攻夏。结果大获全胜。这说明的便是时机的重要作用。"
      ],
      4: [
        "【原文】象曰：革言三就，又何之矣。",
        "【译文】象辞说：既然改革的言语实现十分之三，又往什么地方去呢？",
        "【启示】九三处于改革初见成效的阶段，“新官上任三把火”，三把火点得很旺，收到了良好的效果，应将改革深入下去。但九三只是个躁动之才，像个愣头青。对于九三这个急性子人来说，按兵不动无异度日如年，要大刀阔斧地行动，需要反复研究，周密安排。"
      ],
      3: [
        "【原文】象曰：改命之吉，信志也。",
        "【译文】象辞说：改变天命的吉祥，是信心所成就的。",
        "【启示】九四有信心将改革进行到底，这里的信心主要来自于天命的安排。也就是说，九四的行为是顺应天道的，所以他有改革成功的信心。武王伐纣时，卜官说卜兆不祥，认为不宜出兵。可是姜子牙把蓍草折断，把龟壳踏碎，认为这是迷信。结果按照姜子牙的计策出兵攻纣，大获全胜。"
      ],
      2: [
        "【原文】象曰：大人虎变，其文炳也。",
        "【译文】象辞说：大人物像老虎换毛一样改变自己，是文采炳耀。",
        "【启示】君王推行改革要以身作则。唐朝的开元盛世中，李隆基宣布一条节俭的命令，令全国不准以珠玉为饰，不许穿锦缎衣裳，鼓励人们种棉织布。可是李隆基自己的生活却并不节俭，他的改革方案怎么能得到彻底执行呢？结果后来李隆基与杨玉环沉溺于享乐，再也不提这件事了。"
      ],
      1: [
        "【原文】象曰：君子豹变，其文蔚也。小人革面，顺以从君也。",
        "【译文】象辞说：君子像豹子换毛一样改变自己，是文采蔚然可观。小人改换新的面貌，是表面上顺从君王。",
        "【启示】改革已经获得了大成功。变革之前，主要的问题是变革；一旦成功，主要问题就在于守成了。君子已去掉了旧的毛病，小人也洗心革面、重新做人。可是在这一片大好形势下，却仍然不利于出兵打仗。因为小人只是革面，而没有革心。出兵打仗，随时都有发生政变的可能。在改革成功后，应当继续巩固改革的业绩。"
      ]
    },
    yunshisuduan: [
      "革卦运势速断",
      "运势—不稳定，事情多有变动，应决心改革。去旧立新，弃腐朽而生新机。",
      "事业—正处在转折的关键时刻，应顺应形势，时机成熟后立即变革。",
      "爱情—多事之秋，去者难返，迎新为吉。易有外遇或婚外情，容易离婚。",
      "疾病—病大难治，病情多变，须转换求医或手术治疗。应往南方或北方求医。",
      "经商—改行、开业皆吉。适合乱中求财。应大胆求新，适时改变方向。",
      "诉讼—我方被动，有姓名中有草字头的人说合，可以和解。",
      "出行—与一人同往，须防此人，否则有连累。",
      "人生—性格叛逆，不认可主流意识，有革命精神。追求不平凡的人物。"
    ],
    chushizhidao: [
      "代表变革改革，转换势态",
      "得此卦者有应改之弊病",
      "革指改革。积习成积弊，不破则不立，破字当头，立就在其中。得革卦者需要批判和改革，改革需要坚决彻底，不可半途而废。改革是很难的，处处有既得利益者作梗，需要胆识和气魄。但开弓没有回头箭，要咬紧牙关挺住。"
    ]
  },
  24: {
    name: "第17卦 随：泽雷随卦",
    img: "17",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表退让一步，随遇而安",
      "得此卦者应随从众人",
      "随象征虚心随和，同时保障身心的安乐，这样才能得到信赖。得随卦者不可固执己见，应随和众人，从善如流。居高位、有大事业之人，一旦受身边人左右，就该用新桃换旧符。自己的历史应该自己写，别将笔墨付他人。"
    ]
  },
  25: {
    name: "第28卦 大过：泽风大过卦",
    img: "28",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表纠正偏差，拯治弊病",
      "得此卦者应矫枉过正",
      "大过是大的过度，要暴发行动，到了一定关口必须果断行动，不要错过。得大过卦者，矫枉必须过正，不过正则不能矫枉。矫枉过正是成大业者必备的气魄和胆识。拯危救弊要有壮士断腕的魄力，瞻前顾后则会失去良机。"
    ]
  },
  26: {
    name: "第47卦 困：泽水困卦",
    img: "47",
    guayao: ["困，亨，贞，大人吉，无咎，有言不信。", "上六：困于葛藟，于臲卼，曰动悔。有悔，征吉。", "九五：劓刖，困于赤绂，乃徐有说，利用祭祀。", "九四：来徐徐，困于金车，吝，有终。", "六三：困于石，据于蒺藜，入于其宫，不见其妻，凶。", "九二：困于酒食，朱绂方来，利用亨祀，征凶，无咎。", "初六：臀困于株木，入于幽谷，三岁不觌。"],
    guayaoyi: ["困卦，亨通，守正道，大人物吉祥，没有灾难，说话没人相信。", "上六：被困扰在长刺的葛藤中，叫作运动就会后悔。有后悔的事，征讨则吉祥。", "九五：就像被割去鼻子，砍掉了脚，被官服所困，渐渐的可以解脱，有利于举行祭祀。", "九四：迈着缓慢的步子走来，被一辆豪华大车挡住去路，有麻烦，但有好结果。", "六三：被困在乱石中间，依靠有刺的蒺藜爬出来，回到家中，看不到妻子，凶险。", "九二：因酒食过量而受苦，富贵刚来，有利于祭祀先祖，征伐凶险，没有灾难。", "初六：困坐在木桩上，进入幽暗的山谷，三年不见天日。"],
    guaciyaoci: {
      0: [
        [ "【原文】困，亨，贞，大人吉，无咎，有言不信。", 
        "彖曰：困，刚掩也。险以说，困而不失其所，亨；其唯君子乎？贞大人吉，以刚中也。有言不信，尚口乃穷也。",
         "象曰：泽无水，困；君子以致命遂志。" ]
      [ "【译文】困卦，亨通，守正道，大人物吉祥，没有灾难，说话没人相信。", 
      "彖辞说：困卦，阳刚被阴柔所掩盖。处险地而喜悦，不因为困难而放弃自己的目标，所以亨通。这只有君子才能做到啊。守正道大人物吉祥，是因为刚爻居于中位。说话没人相信，说明只靠嘴说会导致穷困。", 
      "象辞说：大泽上面没有水，这就是困卦的卦象。君子从卦象中受到启示，不惜牺牲自己的生命为了志向。" ],
      [ "【启示】困就是陷入困境之意。困卦为四大难卦之一，主大凶象。甲骨文中的“困”字是一个房屋里面长着树木。屋子里面怎么会长着树木呢？原来是树木与杂草充满房屋的意思。这样的房子应该是没人住的。但流浪的穷苦人会临时把这里当作一个安身的家。所以困的引申义便是穷困、贫穷。升是自下往上升，需要很多气力，如果升进不已，超过一定的限度，强弩之末，气衰力竭，走入困境，所以升卦之后是困卦。处于困境中不能急躁，要从容不迫，徐谋出困之计；还要有精神支柱，要看到光明的前途，而不要在精神上先把自己打垮。要脱困不能光靠口说，而要有实际行动。行动与否要因时因势而定，时不宜动而不可躁动，时适宜动而不可不动。", 
      "困穷中仍能自得其乐，唯君子有这般气度。君子能在困中静待时机，处之泰然，便不为大凶。此卦卦辞中说“困而不失其所”，晋代的陶渊明就是其典范。陶渊明生活极其贫困，家中没有存粮；冬天仍然穿短衣，屋子四处漏风，夏天遮不住太阳，冬天挡不住雪花。但在这种穷困中，他写出了“采菊东篱下，幽幽见南山”的田园诗。",
       "摇得此卦者，在事业、财富追求、家庭关系上，都会得势于困难之中，一旦发展起来前途不可限量。婚恋上容易遇到困难，但是结婚之后多为好婚姻。" ]
      ],
      6:[ "【原文】象曰：入于幽谷，幽不明也。", 
      "【译文】象辞说：进入幽暗的山谷，是幽暗不光明。", 
      "【启示】柔弱卑下，缺乏阳刚气质，而又陷入困境之中，进退两难，一困到底，不能自拔。人行走时脚在最下，而坐则臀在最下，臀部被困，正说明人已行动不得，不能自拔。应该退入幽深的山谷，从此隐性埋名，不露面目。九四和初六相应，但是九四本身居位就不中不正，自己是泥菩萨过河——自身难保，哪里还有力量支援初六。" ],
      5:[ "【原文】象曰：困于酒食，中有庆也。", "【译文】象辞说：因酒食过量而受苦，是居中位而有喜庆。", "【启示】困于酒食，连生计都难以维持了，但九二身为阳刚君子，不在乎“身之困”。相反，这却成为荣禄来临的先兆。九二困中求进，确实颇多凶险，但没有咎害。君子居困之时不要消沉，要相信眼前的困境只是黎明前的黑暗，做到耻中自守，安贫乐道。刚刚有荣禄降临到九二身上，此时行事千万要小心谨慎，不搞什么大动作。" ],
      4:[ "【原文】象曰：据于蒺藜，乘刚也。入于其宫，不见其妻，不祥也。", "【译文】象辞说：依靠蒺藜爬出来，是因为阴柔乘驾于阳刚之上。回到家里看不到妻子，这是不祥之兆。", "【启示】六三无才无德，又不甘寂寞。孔子说：“君子固穷，小人穷斯滥矣。”这位六三就是一位“穷斯滥矣”的小人，所以他犯了法，被关进监狱里，监狱的围墙用石头砌成，并且上面铺满了蒺藜。等刑满释放，回到家中已经看不到妻子了。这个六三从监狱回来后，更穷困了，他肯定还会犯法，所以会凶险。" ],
      3:[ "【原文】象曰：来徐徐，志在下也。虽不当位，有与也。", "【译文】象辞说：徐徐而来，是因为他的志向在于求下。虽然位置不当，但会得到下面的援助。", "【启示】其心志在于应合下面的初六。虽然居位不当，因有同道者相比邻而得以弥补。九四与初六正好形成正应。为了得到初六的配合与帮助，九四当然要自上向下去。九四欲得到初六的配合与帮助，但因隔山取水，势必不能性急。九四与初六之间虽有九二阻困，但这是暂时的困难。阴阳相应，终难阻隔，只要坚持住，自然能渡过这个难关。" ],
      2:[ "【原文】象曰：劓刖，志未得也。乃徐有说，以中直也。利用祭祀，受福也。", "【译文】象辞说：就像被割去鼻子砍去了脚，是因为还没有得志。渐渐的可以解脱，是因为九五可以受到神的保佑。", "【启示】高处不胜寒，九五心里不安，困于尊位。九五邻近上六，被上六阴爻所掩蔽，正如光绪帝，身居一国之君，偏偏有慈禧垂帘听政，指手画脚。光绪帝在政治上陷入困境，形势极为严峻，终日处于不安的状态。不过物极必反的，但由于其刚中居正，慢慢地就会得以摆脱。" ],
      1:[ "【原文】象曰：困于葛藟，未当也。动悔，有悔吉，行也。", "【译文】象辞说：被困扰在长刺的葛藤中，是因为位置不当。动一动就会后悔，因后悔而吉祥，是因为行动起来才能走出困境。", "【启示】困卦中有困极必反的道理，困到极点就会走向困的反面。但是上六得吉并不是一帆风顺的，而是在克服了重重困难之后获得的。上六被缠绕的藤蔓所困，而又濒临于危坠之地，不能有任何动作。动则有悔，受困已到了极致，反倒能使他十分冷静地分析自己，有所觉悟。闭门思过，吸取教训，重新制定方案。" ]
    },
    yunshisuduan: [
      "困卦运势速断",
      "运势—在最困难之时，四处无援，事事难有进展，只能静待时机。",
      "事业—境况很差，被小人欺，劳而无功。若采取不正当的手段，会愈陷愈深。",
      "爱情—婚恋难成气候。家中重担多由女方承担，或丈夫有外遇，或夫妇不和。",
      "疾病—多为口腔、泌尿系统之病。行走不便，坐卧不安，宜往西南方求医。",
      "经商—受小人阻碍而不得志，四处碰壁，有破产的可能。应泰然处之。",
      "诉讼—有人在狱中之象，或纷争难解，双方僵持。",
      "出行—略有阻隔无妨，宜向西北方去。防财失。",
      "人生—性格静若止水。有冒险精神，在困难之中见气节，容易被人利用。"
    ],
    chushizhidao: [
      "代表气衰力竭，陷入困境",
      "得此卦者要从容不迫，徐谋出路",
      "困指受困。得困卦者如同杨志卖刀，英雄处于末路。如果自得其乐、坚持原则、坚持不懈才能得到解脱。此时不要画地为牢，外面的世界很精彩，走出囚禁自己的无形高墙，会发现自己一直在坐井观天。"
    ]
  },
  27: {
    name: "第31卦 咸：泽山咸卦",
    img: "31",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表心灵感应，认同欣赏",
      "得此卦者要从争取人心着手",
      "咸表示不可三心二意，动机纯正才可以吉利。得咸卦者，大多是两情相悦，心灵沟通，互补而双赢。但别高兴得太早，令你头痛的事可能在后头。因为“唯女子与小人难养也，近之不逊、远之则怨。”"
    ]
  },
  28: {
    name: "第45卦萃：泽地萃卦",
    img: "45",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表物以类聚，聚集精华",
      "得此卦者重在蓄势",
      "萃指聚集，聚集使物资丰富，人们团结，势力变大，利于进取。得萃卦者如同不同的事物汇聚一堂，可以竞争，但不要相残。物以类聚，大家能在同一方寸之地扎根，是缘分。虽然是借他人之壳上市，但可以往自己口袋装钱。"
    ]
  },
  // 3
  31: {
    name: "第14卦 大有：火天大有卦",
    img: "14",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表物归我有，谷仓满溢",
      "得此卦者不可独自占有",
      "大有象征高高在上，拥有天下。此时应虚怀若谷，不可骄傲伤人。得大有卦者虽然当前的势头很好，但结果却难说。别人看中的只是利益，无利则作鸟兽散；不懂辩证法，“大有”将会成为一无所有。所以应该与他人分享利益。"
    ]
  },
  32: {
    name: "第38卦 睽：火泽睽卦",
    img: "38",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表背离反目，亲友疏散",
      "得此卦者应减少猜疑心",
      "睽象征反目，此时不能成就大事，只能做小事。得睽卦者，亲近的人容易反目成仇。如果十件事中有九件事愉悦，仅一件事有毛病，不要太计较。缘分尽即分手，没有必要结冤仇。气归气，还是要想想往日的情谊，对方的好处。"
    ]
  },
  33: {
    name: "第30卦 离：离为火卦",
    img: "30",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表依附附丽，亲近辅助",
      "得此卦者最怕引火烧身",
      "离象征无限光明，但火焰要有所依附，依附正当则可以持续光明。得离卦者往往心绪不定，性急者易败事。不可冲动，否则烧伤了别人的同时也熄灭了自己。为他人作嫁衣也是一种享受，有其名无其实总比名实两缺要强。"
    ]
  },
  34: {
    name: "第21卦 噬嗑：火雷噬嗑卦",
    img: "21",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表全力应战，排除障碍",
      "得此卦者难得糊涂",
      "噬嗑就是咀嚼，咬碎食物，象征铲除障碍才能亨通。得噬嗑卦者要学会含糊其辞、打擦边球。模糊是一种修养境界，模棱两可之间，许多事情可顺利解决。如果太过认真、较真，会失去人心，或把事情搞砸。"
    ]
  },
  35: {
    name: "第50卦 鼎：火风鼎卦",
    img: "50",
    guayao: [
      "鼎，元吉，亨。",
      "上九：鼎玉铉，大吉，无不利。",
      "六五：鼎黄耳，金铉，利贞。",
      "九四：鼎折足，覆公餗，其形渥，凶。",
      "九三：鼎耳革，其行塞，雉膏不食，方雨亏悔，终吉。",
      "九二：鼎有实，我仇有疾，不我能即，吉。",
      "初六：鼎颠趾，利出否，得妾以其子，无咎。"
    ],
    guayaoyi: [
      "鼎卦，大吉祥，亨通。",
      "上九：鼎上配以玉饰的举鼎杠，大吉祥，没有不利的。",
      "六五：鼎上铸有黄色的鼎耳，铜饰的举鼎杠，利于守正道。",
      "九四：鼎腿折断，（鼎倒使）王公的美味佳肴洒了一地，显得又脏又乱，凶险。",
      "九三：鼎耳掉了，移动鼎有困难，里面的山鸡肉也吃不上，刚好有雨，悔恨渐消，最终吉祥。",
      "九二：鼎中有食物，我的敌人有病，不能和我一起分享，吉祥。",
      "初六：鼎颠倒使腿朝上，利于倒出里面的脏物，得到妾而能获得孩子，没有灾难。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】鼎，元吉，亨。",
          "彖曰：鼎，象也。以木巽火，亨饪也。圣人亨以享上帝，而大亨以养圣贤。巽而耳目聪明，柔进而上行，得中而应乎刚，是以元亨。",
          "象曰：木上有火，鼎。君子以正位凝命。"
        ],
        [
          "【译文】鼎卦，大吉祥，亨通。",
          "彖辞说：鼎卦便是鼎的形象。以木生火烧鼎，可以烹饪食物。圣人用鼎煮食物祭祀上帝，大量烹煮食物以养圣贤之人。随顺并且耳聪目明，柔顺向上发展，即得中正又有阳刚之气相呼应，所以大亨通。",
          "象辞说：木上生火便是鼎卦的卦象。君子从卦象中受到启示，端正自己的位置，重视上天赋予的使命。"
        ],
        [
          "【启示】在甲骨文中，“鼎”字上面的部分像鼎的左右耳及鼎腹，下面像鼎足，是一个象形字。鼎卦六爻的排列正好组成一个鼎的形象。其最底下的阴爻代表鼎足，中间的三个阳爻代表鼎腹，六五代表鼎耳，上九代表鼎杠。鼎是一件不寻常的厨房用品。它集权力、律法、威信于一身，是国家的重器。在中古时代，天子初登龙位的时候，第一件事便是铸鼎，颁布法律，以示吉祥。",
          "鼎可用来象征变革。革是变故，改变旧事物；鼎是取新，建设新事物。鼎容易折足，也有推陈出新的含义。所以鼎卦紧接在革卦之后。鼎是建立一个新社会，巩固一个新局面。不像革卦是变革旧社会，施行起来还十分复杂，故鼎卦不讲条件，一切都通达顺畅。鼎卦与井卦卦义有一些共通之处，不过，井卦重在养民，而鼎卦重在养贤。",
          "鼎以三足而立，态势平稳。此时事业可为，不应延滞。事业与人合伙为佳，可在平稳中发展。事业需要借助家族的力量，家庭团结或有家人帮助。求财可成，求他人之力有利。但对感情、婚姻略有凶象，测婚姻时，家庭顶梁柱会出现问题。此外，三角恋爱、三人同行的机率很高，有外遇出轨的迹象，已婚女性得此卦有两女侍一夫之象，但会理智地解决。最重要的是不可失去相互协助的关系。"
        ]
      ],
      6: [
        "【原文】象曰：鼎颠趾，未悖也。利出否，以从贵也。",
        "【译文】象辞说：鼎颠倒使腿朝上，这不属于悖逆的事情。有利于倒出里面的脏物，说明初六应当顺从尊贵者的安排。",
        "【启示】用鼎做饭之前要先清洗，喻示从事一项新事业之前，要先调整思想，摒弃旧观念。起用新人治理天下，要唯贤是举，不分贵贱。商汤起用伊尹为相时，伊尹是一个奴隶，可是伊尹却帮助商汤推翻了夏王朝。商朝的武丁任用傅说为相时，傅说是一个给人家筑墙的农夫，可是傅说却使商王朝出现了中兴。"
      ],
      5: [
        "【原文】象曰：鼎有实，慎所之也。我仇有疾，终无尤也。",
        "【译文】象辞说：鼎中有食物，要谨慎地移动它。我的敌人有病，最终没有忧虑。",
        "【启示】贤明的君王与诸侯列鼎而食，可是由于君王起用了卑贱的人为大臣，自然会有一些人看不惯，所以不想与下贱的新贵一起吃饭，而没有赴宴。没来赴宴的人，正是不支持君王变法的人，所以这些人不来是一件吉祥的事情。因为君王不会因此而失去贤臣。"
      ],
      4: [
        "【原文】象曰：鼎耳革，失其义也。",
        "【译文】象辞说：鼎耳掉了，便失去了鼎耳的意义。",
        "【启示】九三具有阳刚之才，但没有派上用场。古时初期的鼎耳就是铸在九三这个位置的。可是由于在这里经常会断裂，所以后来改在六五处铸鼎耳了。初登位的天子用新的政策治理国家时，要精简机构，去掉没必要的政府机构，节约开支。对于精简下来的政府官员，要施以一定的恩惠，使他们不至于心怀怨恨。"
      ],
      3: [
        "【原文】象曰：覆公餗，信如何也。",
        "【译文】象辞说：王公的粥都洒了，还怎么再受信任呢？",
        "【启示】九四相当于国家重臣，所以他的失误会对整个国家（鼎）造成损失。九四的失误在于用错了人。他与初六相应，可见他是一个勇于提拔新人，并且不分身份贵贱的好领导。可是他任用的人当中却有没能力的人，会对国家造成损害。"
      ],
      2: [
        "【原文】象曰：鼎黄耳，中以为实也。",
        "【译文】象辞说：鼎上铸有黄色的鼎耳，说明六五居中坚实。",
        "【启示】鼎的功用要想发挥出来，关键问题在于鼎器要能移动。如果只停留于一处，怎能奉养大量的人？移动鼎的必备条件是要有“耳”。耳虽然不是鼎的主体，却是最重要的部件。有了它才可以将鼎提起来，就相当于有了天子才能将诸侯统一起来一样。鼎耳位于君位。六五有了移鼎的客观条件，但毕竟是阴柔之质，还要努力守正，遵循正道。"
      ],
      1: [
        "【原文】象曰：玉铉在上，刚柔节也。",
        "【译文】象辞说：玉饰的举鼎杠在上位，是刚柔调节。",
        "【启示】由于鼎是国家、权力、律法的象征，所以古代的君王对鼎的铸造极其讲究，而抬鼎用的举鼎杠制作得极其精美，是因为它们都是国家的祭器。一个国家只有按时举行祭祀，才能感召天下人，加强各诸侯的团结。因为古代的天子是替天行道，所以重视祭祀，则表明自己没有脱离天道。"
      ]
    },
    yunshisuduan: [
      "鼎卦运势速断",
      "运势—去旧立新，改过迁善之象。适合找人共事或合伙，但不应迟滞。",
      "事业—利于创业，可得上辈提拔，主吉象。适合变革，可以迅速进行。",
      "爱情—吉中带凶，外表平稳，但可能有第三者介入，且不易被发现。",
      "疾病—病情有变，但可无碍。去医院治疗的效果不明显。",
      "经商—利于开业，可顺利开展活动，遇到困难也能够克服。",
      "诉讼—因小是非而引起矛盾，宜找第三个人劝和，可和解。",
      "出行—途中与人同行，可能有忧虑，三个人中有一个人不合。",
      "人生—仕途比商场更利于发展。多信奉佛教，但不如祭拜祖先。"
    ],
    chushizhidao: [
      "代表推陈出新，重在养贤",
      "得此卦者处于鼎新之时",
      "鼎象征王权的威严，有威严才可做事，但威严过重会适得其反，所以要内含谦逊。得鼎卦者要吐故纳新，一日新方能日日新。鼎新的要点在立不在破，在化不在变，变与破是化与立的基础。原材料已经准备好，等着厨师调和吧。"
    ]
  },
  36: {
    name: "第64卦 未济：火水未济卦",
    img: "64",
    guayao: [
      "未济，亨，小狐汔济，濡其尾，无攸利。",
      "上九：有孚于饮酒，无咎。濡其首，有孚失是。",
      "六五：贞吉，无悔，君子之光，有孚，吉。",
      "九四：贞吉，悔亡，震用伐鬼方，三年有赏于大国。",
      "六三：未济，征凶，利涉大川。",
      "九二：曳其轮，贞吉。",
      "初六：濡其尾，吝。"
    ],
    guayaoyi: [
      "未济卦，亨通，小狐狸快要能够走过小河，沾湿了它的尾巴，无所利。",
      "上九：带着诚信饮酒，没有灾难。如果酒喝多了，将酒浇到头上，有诚信也会失去。",
      "六五：守正道吉祥，没有悔恨，君子的光耀，有诚信，吉祥。",
      "九四：守正道吉祥，没有悔恨，振奋起来征伐鬼方国，三年获得成功，得到大国的奖赏。",
      "六三：没有渡过河，征伐有凶险，有利于跋涉大川。",
      "九二：拉着车轮，守正道吉祥。",
      "初六：沾湿了尾巴，有忧吝。"
    ],
    guaciyaoci: {
      0: [
        [
          "未济，亨，小狐汔济，濡其尾，无攸利。",
          "彖曰：未济，亨；柔得中也。小狐汔济，未出中也。濡其尾，无攸利；不续终也。虽不当位，刚柔应也。",
          "象曰：火在水上，未济；君子以慎辨物居方。"
        ],
        [
          "【译文】未济卦，亨通，小狐狸快要能够走过小河，沾湿了它的尾巴，无所利。",
          "彖辞说：未济卦的亨通，是由于六五爻以柔顺居中。小狐狸过河，是还没有走出河中。沾湿了尾巴，无所利，是说明不能努力走到终点。虽然六爻没有得位，但能够做到刚柔相济。",
          "象辞说：火在水上便是未济卦的卦象。君子从卦象中受到启发，谨慎分辨各种事物，选择好自己居住的地方。"
        ],
        [
          "【启示】既济表示事已成，未济表示事未成。与既济卦水在火上可以煮食相反，未济卦火在水上，不能烹饪，象征事未成，处于完全的混乱无序状态中。未济是没渡过河的意思。其引申义为未完成、未终止。人们常用“时运不济”形容运气不佳，这“不济”就是“未济”。既济之时要慎终如始，未济之时则要慎始慎终，一个环节疏忽大意就可能功亏一篑。",
          "从卦象上看，火在水上，火向上而水向下，不再相交，无法互补平衡。六爻皆不得位，君不像君臣不像臣，国已不国。这么不好，卦辞中怎么还有“亨”呢？因为此卦是一个新开始的过渡阶段，任何力量也阻挡不了，所以亨通。但这种过渡极其艰苦，君子该怎么办呢？要明辨各类事物，重点在于选择。一切均会雨过天晴，值得等待。",
          "既济、未济两卦在六十四卦中的地位极为特殊，仅次于乾、坤两卦。《易经》的作者把事物看做有始有终、终而复始、有生有灭、生生不息的过程。而这个过程是由阴阳相聚所形成的天地为起始的，故以乾坤两卦为开始；天地生成万物，遂有千万种变化，故乾坤两卦之后的各卦展开各种矛盾斗争：从自然规律到政治形势，从统治阶级到普通百姓，从婚姻家庭到衣食住行，从文化民俗到哲学思想……过程总有穷尽之时，矛盾总有解决之时，所以经过无数阴阳消长、事物盛衰的矛盾斗争，终于有了一个终结，迎来了阴阳协调、矛盾消失、大功告成、万事亨通的既济时代。矛盾的止息只是相对的，运动才是绝对的，随着旧事物的终结，新事物必将产生，所以并不以既济作结，而是以未济作结。这充分反映了作者对宇宙变易无穷的认识。",
          "此卦有妇凌夫之象。男性有较女方贫困而受其辱的可能，女性应防外遇。预测婚姻，多劳但可成，有先难后易之象。也有精神恋爱的可能，或没有恋爱过程而直接结婚。性格上有自己的处世理论，忘记昨天而去做明天的事情。容易追求虚幻的东西，如信仰道教。"
        ]
      ],
      6: [
        "【原文】象曰：饮酒濡首，亦不知节也。",
        "【译文】象辞说：酗酒以至将酒浇到了头上，这也太不知节制了。",
        "【启示】最后渡过了危险期，太平了，安稳了。人们开始饮酒作乐，无所节制了。喝醉了还喝，以至于本来想把酒倒进嘴里，结果却倒到了头上。既济卦贵在止，未济卦贵在动，可是未济卦的上九是“动”得有些过度了，不知节制。这是告诫人们做事要有分寸，要有节制。"
      ],
      5: [
        "【原文】象曰：君子之光，其晖吉也。",
        "【译文】象辞说：君子的光耀，是说在他的光彩照耀下带来了吉祥。",
        "【启示】象征君子之光，代表渡河成功。这是从未济转向既济的关键。六五有得到众贤臣辅佐之象，不仅自己能守持正固获得吉祥，而且下应九二，能带领大家共同渡过未济难关，进入既济的太平盛世。如同太阳驱散了乌云，光照大地，给人们带来光明。"
      ],
      4: [
        "【原文】象曰：贞吉悔亡，志行也。",
        "【译文】象辞说：守正道吉祥，没有悔恨，是由于九四爻志在必行。",
        "【启示】已脱离坎险，命运已开始改变，但天上不会掉下馅饼，应奋起斗争，投入艰苦卓绝的斗争。比如武丁之后，商朝又出现了一次衰落。各诸侯开始反叛商朝。周文王的父亲季历带着兵将协助商朝天子讨伐西羌的鬼方国，经过三年后打败了鬼方，并因此受到了商朝天子的重赏。这个故事是激励九四要像周文王的父亲那样建功立业，大胆行动。"
      ],
      3: [
        "【原文】象曰：未济征凶，位不当也。",
        "【译文】象辞说：没有渡过河，征伐有凶险，是由于六三的位置不当。",
        "【启示】在事未成之时，以阴柔之质处坎险之上，居位不当，此时不宜妄动，更不利涉大川，若强行前进，必有凶险。六三是下卦坎的上爻，是上互卦坎的下爻，身前身后全是水，所以有还没有渡过河的形象。在险难重重的处境下，当然不利于打仗。"
      ],
      2: [
        "【原文】象曰：九二贞吉，中以行正也。",
        "【译文】象辞说：九二爻守正道吉祥，是居中而行正道。",
        "【启示】九二代表河的中央，是渡河最关键、最险要的地方。只有信心坚固、谨慎万分，才能顺利脱离险境。九二虽不得位，但有初六、六三与六五相助，所以遇险有救，可以渡过河去。从卦象上看，坎为弓轮，所以有“曳其轮”的形象。又由于坎为水，所以有驾车过河之意。"
      ],
      1: [
        "【原文】象曰：濡其尾，亦不知极也。",
        "【译文】象辞说：沾湿了尾巴，也不知道已到了自己承受的极限（即狐狸尾巴都湿了，说明水再深一些，小狐狸就有危险了）。",
        "【启示】小狐还没有走到河中央就把尾巴浸湿了，说明再往前走水更深，根本过不了河。一直朝前走肯定会被水溺死。但为了生存，它必须过河。这是自然法则的优胜劣汰。一场灾难，一个转折，都是一种自然的淘汰赛。就像无能的人担任着重任，肯定吃不消。"
      ]
    },
    yunshisuduan: [
      "未济卦运势速断",
      "运势—凶中带小吉、初衰后盛之象。气运不通，百事不如愿，阴阳不调和。",
      "事业—运气不佳，处于关键时刻。但因为“未完成”，所以前途无量。",
      "爱情—开始时不能沟通，背对而处，格格不入。应该慢慢接受对方。",
      "疾病—容易得慢性疾病。病情很不稳定，似有危险，应往东北方求医。",
      "经商—改行、开业为吉。初时不佳，前景不明确，有渐渐好转之象。",
      "诉讼—事情头绪杂乱，矛盾难解，我方克对方，最终会和解。",
      "出行—有四人同行，先失后得，虽有口舌但无妨。",
      "人生—自己闯荡，获得财富没有过程只有结果，适合长期投资。"
    ],
    chushizhidao: [
      "代表事情未成，混乱无序",
      "得此卦者面临新起点",
      "未济指渡河尚未成功，秩序混乱、时运不济就是“未济”。得未济卦者虽然混乱无序，但此时也是一个新开始的过渡期。这喻示着吉凶未定，使人对未来产生希望。如同种子刚刚播下，新的一次轮回开始了，一切都未确定。"
    ]
  },
  37: {
    name: "第56卦 旅：火山旅卦",
    img: "56",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: [
      "旅卦运势速断",
      "运势—小吉。变动不定，只能坚守信心，从小处着手，多参考他人意见。",
      "事业—事情多变，虽不现凶象，但令人烦心。应先图生存，先易后难。",
      "爱情—小矛盾多，意见不一。不确定因素多，游戏心态重。容易离婚。",
      "疾病—情况变化不定，有病情转移之象，应速求医，不可拖延。",
      "经商—障碍多，意料之外之事会随时发生。不可冒险，应从小买卖做起。",
      "诉讼—即使我方有理也应和解，若不和则有灾。",
      "出行—情况反覆，一会东一会西，两人同行则不可求财，否则易有损失。",
      "人生—不安分，思想灵动，很有活力。喜欢走动，但容易疲惫孤独。"
    ],
    chushizhidao: [
      "代表羁旅于外，寄人篱下",
      "得此卦者要耐得住寂寞",
      "旅指旅行，这是不安定的行为，因为旅途中缺少照应。得旅卦者如同旅行在外之人，举目无亲，孤立无援，无法倾诉。征程漫漫，要经历风霜雨雪才能见到希望。此时要耐得住寂寞，需要信念的支持。"
    ]
  },
  38: {
    name: "第35卦 晋：火地晋卦",
    img: "35",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表日出地面，加官晋爵",
      "得此卦者可在左右逢源中成事",
      "晋就是前进、上升，只有忠于职守的人才能得到提升。得晋卦者，最大的乐趣在于进取，最大的欣慰在于得到他人的赏识。已经赢得了上上下下的普遍尊重，但在鲜花掌声中切记成就来之不易。此时有人暗中妒忌，需慎防。"
    ]
  },
  // 4
  41: {
    name: "第34卦 大壮：雷天大壮卦",
    img: "34",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表过于强猛，易生过失",
      "得此卦者得意时别忘形",
      "大壮就是壮盛，不但要“大”而且要“正”才能成功。得大壮卦者要凭实力说话，虽是大器晚成，但可以施展拳脚。媳妇终于熬成了婆，但前面的路还长得很，躁动、过于强猛容易生过失。"
    ]
  },
  42: {
    name: "第54卦 归妹：雷泽归妹卦",
    img: "54",
    guayao: [
      "归妹，征凶，无攸利。",
      "上六：女承筐无实，士刲羊无血，无攸利。",
      "六五：帝乙归妹，其君之袂，不如其娣之袂良，月几望，吉。",
      "九四：归妹愆期，迟归有时。",
      "六三：归妹以须，反归以娣。",
      "九二：眇能视，利幽人之贞。",
      "初九：归妹以娣，跛能履，征吉。"
    ],
    guayaoyi: [
      "归妹卦，征伐会有凶险，无所利。",
      "上六：新娘提着空篮子里面没有果实，新郎杀羊却没有留出羊血，无所利。",
      "六五：纣王的父亲将妹妹嫁给周文王，王后的衣饰还不如陪嫁者的衣饰好，月亮快圆的时候，吉祥。",
      "九四：少女出嫁延误了婚期，只是晚一些出嫁但总会嫁出去的。",
      "六三：少女出嫁时以少女的姐姐作为陪嫁，嫁过去以后姐姐为妾，所以反而成为妹妹的妹妹了。",
      "九二：瞎了一只眼睛可是还可以看清事物，有利于未嫁少女守正道。",
      "初九：少女出嫁并将少女的妹妹也嫁过去，两人可以互相帮助，前往吉祥。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】归妹，征凶，无攸利。",
          "彖曰：归妹，天地之大义也。天地不交，而万物不兴，归妹人之终始也。说以动，所归妹也。征凶，位不当也。无攸利，柔乘刚也。",
          "象曰：泽上有雷，归妹；君子以永终知敝。"
        ],
        [
          "【译文】归妹卦，征伐会有凶险，无所利。",
          "彖辞说：少女出嫁是体现天地交合的大道理。天地的阴阳之气不互相交合，万物就不能繁殖兴旺，少女出嫁可以使人类终而复始，生生不息。喜悦而运动，这就是归妹卦。征讨凶险，是因为所处的位置不当。没有什么利益，是因为柔爻乘驾于刚爻之上。",
          "象辞说：泽上有雷就是归妹卦的卦象。君子从中受到启示，明白有终无始的弊端。"
        ],
        [
          "【启示】“归”的本意是女子出嫁，引申义为归宿、回家。归妹代表少女出嫁。出嫁是女人的最终归宿，上一卦渐卦为女子待嫁，所以渐卦的后面是归妹卦。归妹是关系到人类终始的大问题。《易经》中有四卦表示男女关系：咸、恒、渐、归妹，其中数归妹卦最不好。在六十四卦中，卦辞没有一点好处的只有归妹与否两卦。出嫁是喜庆的事情，但此卦并非正常结婚，不是两厢情愿，而是去抢夺少女成婚。此时女性处于被动地位，多为被迫进行肉体的结合，缺乏精神之爱。另外，此卦含有小妹比姐姐更急于出嫁之象，多为感情冲动、不理智，所以为小吉带凶。",
          "在我国上古时代，抢婚制较为流行。如果女方不愿意，男方强迫娶妻，这对双方都没有好处。《易经》成书时，抢婚只是一种形势，早已没有了当初的强迫与残忍。但此时出现了女人夺夫权的问题。一个家庭中，男主人与女主人经常为了权力而争吵，怎么会有好处呢？这也反映出臣下权大欺君的弊端。",
          "女性得此卦者多有障碍，思虑不决。求财多为半途而废，需要独立的商业意识，适应和朋友共同奋斗合作。成就事情需要独立精神，家族很难成为其有力依托。预测婚姻，女性有被外诱之象，也有重夫之象，非良缘，易失败。应充实精神，促进成长，使其长久维持下去。"
        ]
      ],
      6: [
        "【原文】象曰：归妹以娣，以恒也。跛能履吉，相承也。",
        "【译文】象辞说：少女出嫁并将少女的妹妹也嫁过去，是合乎常规的行为。这样可以像腿拐有人搀扶一样，可以互相帮助。",
        "【启示】嫁出少女给人做偏房，并不是什么淫奔之行，并未失婚嫁之常道。一夫多妻制度是原始社会群婚制的遗迹，为当时社会所承认。现在结婚仪式中有伴娘与伴郎，但在古代，伴娘得跟着新郎一块过日子。在周朝，诸侯娶一个妻子，一共可以得到九个女子。因为还有陪嫁过来的女子。一般是正室夫人一名，随嫁娣侄二人为媵，也称介妇；正室与媵又各有二侄娣陪嫁，共九个人。"
      ],
      5: [
        "【原文】象曰：利幽人之贞，未变常也。",
        "【译文】象辞说：有利于未嫁少女守正道，是没有违反常规道德。",
        "【启示】六三为出嫁的妹妹，初九与九二为从嫁的娣。九四为新郎，六五为帝乙主婚，上六为宗庙受祭。九二是一个意志坚定的贤慧女子，初九与九二可以帮助六三这个出嫁的新娘。可以帮助新娘不受欺负是对的，如果帮助新娘夺夫权就不对了。九二性格坚强，能自执其志，始终用自己的贤德对待夫君的不贤，不会发生婚变。"
      ],
      4: [
        "【原文】象曰：归妹以须，未当也。",
        "【译文】象辞说：少女出嫁时以少女的姐姐作为陪嫁，是位置没有摆恰当。",
        "【启示】新郎看中了妹妹，可是姐姐却还没出嫁，由于姐姐也觉得这家人不错，所以便作为陪嫁的与妹妹一起嫁过去。可是嫁过去以后，由于妹妹是正室，姐姐的身份要比妹妹低。这样姐妹俩便不会很好相处。比如陈世美已经有原配夫人，后来他又娶了皇帝的女儿，可是如果陈世美想逃过包公的铡刀，就得认自己的原配妻子，并且以原配妻子为正室，公主为妾。"
      ],
      3: [
        "【原文】象曰：愆期之志，有待而行也。",
        "【译文】象辞说：延误婚期的愿望，是有所等待再出嫁。",
        "【启示】双方已经订好了迎亲的日子，可是女方推迟了婚期，这种情况也是允许的。这好比刘备三顾茅庐请诸葛亮，虽然诸葛亮一再推迟见刘备的日子，但最终还是跟随了刘备。按现在的话来说，这种做法有些扭捏作态，可是在古代却是一种权术，含有调胃口的成分。"
      ],
      2: [
        "【原文】象曰：帝乙归妹，不如其娣之袂良也。其位在中，以贵行也。",
        "【译文】象辞说：纣王的父亲将妹妹嫁给周文王，王后的衣饰还不如陪嫁者的衣饰好，但王后的位置居于中位，是以尊贵的身份出嫁的。",
        "【启示】自古王室女子，大都恃骄而宠，六五却不是这样。地位尊贵嫁为正妻，但衣饰还不如侧室的华美。商朝的天子将自己的表妹下嫁于周文王，这是周人念念不忘的一件盛事。尤其是帝乙的妹妹有节俭的美德，她所穿的衣服比陪嫁的娣穿的还要差。穿着简朴的新娘就像圆月一样引人注目，新娘与新郎能够幸福美满地生活在一起。"
      ],
      1: [
        "【原文】象曰：上六无实，承虚筐也。",
        "【译文】象辞说：上六阴爻中虚无实，就如同新娘手中提的空篮子一样。",
        "【启示】上六名存实亡。作为妇人似乎有资格与丈夫一起进行祭祀活动，但是作为偏室却没有这个资格。古人结婚后要举行祭祀祖先的活动，以求先祖保佑夫妻平安和多生子息。可是女方既不是处女，又不能生育，还有什么利益呢？在封建社会，这是让男人感到很吃亏、很没面子的一件事。"
      ]
    },
    yunshisuduan: [
      "归妹卦运势速断",
      "运势—初时有悦，不久反凶，祸出百端，愿望受阻，有违常理，不可强行。",
      "事业—百事难保，多有不测之祸，正直反而有困难，也有色情破财之兆。",
      "爱情—有女追男之象，但多为悲剧。不可违背原则。不可强求，宁可晚婚。",
      "疾病—易反复，会恶化。多为肝病、肿瘤、骨髓之病。宜向东南方求医。",
      "经商—开拓新的市场即将成功。在商业活动中注意与他人的合作。",
      "诉讼—事情可能与女人有关，暗昧不清晰，宜和解。",
      "出行—女人不动则无事，如果遇阻隔，在未申日可动。",
      "人生—要注重追随权贵之人。仕途上难成魁首，有封号也是傀儡。"
    ],
    chushizhidao: [
      "代表感情冲动，强迫结合",
      "得此卦者受到笼络羁縻",
      "归妹指少女出嫁，此时要两厢情愿，不可强迫，否则应立刻终止。得归妹卦者，往往一厢情愿地用热脸去贴他人的冷屁股，人家未必领情。怀柔、和亲里反映了虚伪与无能。事关人格自尊，不要自取其辱。"
    ]
  },
  43: {
    name: "第55卦 丰：雷火丰卦",
    img: "55",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: [
      "丰卦运势速断",
      "运势—吉中带小凶。雷电交加，声势壮大，运势极强，注意物极必反。",
      "事业—鼎盛时期，但注意衰败之兆，应防微杜渐，保持当前状况的延长。",
      "爱情—情投意合则速成，得意忘形则有失。如果一方自持或动摇则不利。",
      "疾病—多为急性病，注意心脏病或意外伤害，可往东南方求医。",
      "经商—改行、开业者吉。利于短期投资，但若有不慎，可能在一夜间破产。",
      "诉讼—先吉后凶，小事变大，多反复。若拖延很长时间才见官，会难以摆脱。",
      "出行—有阻隔，为他人所误，不可急动。",
      "人生—人生平淡无奇。成功多为爆发，持续时间不长，而后恢复平淡。"
    ],
    chushizhidao: [
      "代表万丈光芒，绝对盛大",
      "得此卦者最好功成身退",
      "丰指丰收、收获了果实。得丰卦者，一切都得到了满足，但极盛必衰，盛景中有衰退的趋势，盛大中暗藏凶险，此后会进入衰败的淡季，要居安思危。狡兔死，猎狗烹；飞鸟尽，良弓藏，应该以退为进。"
    ]
  },
  44: {
    name: "第51卦 震：震为雷卦",
    img: "51",
    guayao: ["震，亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。", "上六：震索索，视矍矍，征凶。震不于其躬，于其邻，无咎。婚媾有言。", "六五：震往来厉，亿无丧，有事。", "九四：震遂泥。", "六三：震苏苏，震行无眚。", "六二：震来厉，亿丧贝，跻于九陵，勿逐，七日得。", "初九：震来虩虩，后笑言哑哑，吉。"],
    guayaoyi: ["震卦，亨通。大的雷声让人感到害怕，可是人们明白雷声会降下雨泽，所以听到雷声都很高兴，尽管雷声震惊百里，却不会震落手中的酒杯。", "上六：雷声使人们索索发抖，六神无主，征讨凶险。由于震不在自身，而在邻人，所以没有灾难。婚配会有怪责之言。", "六五：在震动中来回奔跑有危险，多亏没有大的损失，只是有些困扰。", "九四：惊雷坠入淤泥里。", "六三：震动使人恐惧不安，行动没有灾难。", "六二：惊雷袭来有危险，人们丢弃家财，跑到山陵上，不要追赶，七天后会失而复得。", "初九：雷声响起人们感到不安，雷声过后人们笑语声声，吉祥。"],
    guaciyaoci: {
      0: [
        [ "【原文】震，亨。震来虩虩，笑言哑哑。震惊百里，不丧匕鬯。", "彖曰：震，亨。震来虩虩，恐致福也。笑言哑哑，后有则也。震惊百里，惊远而惧迩也。出可以守宗庙社稷，以为祭主也。", "象曰：洊雷，震；君子以恐惧修身。" ],
        [ "【译文】震卦，亨通。大的雷声让人感到害怕，可是人们明白雷声会降下雨泽，所以听到雷声都很高兴，尽管雷声震惊百里，却不会震落手中的酒杯。", "彖辞说：震卦亨通。震惊来临人们感到害怕，恐惧可以招来福佑。笑语声声，说明人们已经懂得了天地的规则。震惊百里，是震惊远方而使近处惧怕。君王出巡，长子守住宗庙社稷，作为祭祀的主持人。", "象辞说：雷声一阵一阵响起，便是震卦的卦象。君子因有所恐惧而反省自己的过失。" ],
        [ "【启示】震的本意是雷声。从卦象上看，两震相重，有雷声接连不断的意思。雷电可击杀邪恶势力，也可以给万物赋予生机。所以震卦既含有上天对人间进行惩戒的含义，又含有律法及政治运动对社会的惩治，还象征新秩序建立的起源。古人对雷是极其敬愄的，但它实际上并没有严重灾害，只要冷静对待就会安然度过。所以，此卦也表示虚有其表，虚张声势，要特别警惕。在古人看来，打雷是天发怒了，这时该怎么做？一、不要触犯天道、法律。二、在遇到惊险时要谨慎小心，临危不惧，镇定自若。三、发布号令、制定法规也要震惊百里，像打雷一样，要贯彻到所有人、所有地方，使上下都惊惧，远近无一遗漏。本卦揭示出的大多是心理而不是事理，是心态而不是事态。", "得此卦者，初时危难，事情多有受惊、变动、喧噪的情况。须谨慎、戒惧，以免有失。女性预测婚姻，为两女争嫁而处境不利。此卦之阳气为重阴所抑制，压力愈大则抵抗愈强，势有冲破阴爻之象。如男性受女性的无理压制，有大发雷霆，一发不可收拾之势。雷为声势浩大、有声无形之虚象，所以，与人交往多为表面热心，内心不诚。" ]
      ],
      6:[ "【原文】象曰：震来虩虩，恐致福也。笑言哑哑，后有则也。", "【译文】象辞说：雷声响起人们感到不安，是因为恐惧可招致福佑。笑语声声，说明人们已经懂得了天地的规则。", "【启示】震雷打来时万民惶恐惊惧，若镇定能导致福泽。临震而能镇定自若，谈笑自如，说明初九在恐惧戒慎之后，行为就能遵循法则而不失常态。有两种人：一种是平日松懈，没有恐惧，当震雷炸响时却恐惧不已；一种是平日不敢自宁，谨慎戒惧，当震雷炸响时反倒镇定自若。初九说的是第一种人，希望这种人由于对震雷的恐惧而能修己省过，从此不敢自宁。" ],
      5:[ "【原文】象曰：震来厉，乘刚也。", "【译文】象辞说：惊雷袭来有危险，是因为六二凌驾于初九刚爻之上。", "【启示】六二紧临震动的中心，受到震动最严重。六二虽然有中正之德，但非常害怕，逃跑中丢了不少财物。但震动不是针对他而来的，所以震动过后他还会拥有自己的地位与财物。这就好比一场奴隶暴动。奴隶不堪忍受残酷的压迫，结果造反了。在这场运动中，六二很害怕，躲了起来。可是他平时有中正之德，善待奴隶，所以他不会有灾难。" ],
      4:[ "【原文】象曰：震苏苏，位不当也。", "【译文】象辞说：震动使人恐惧不安，是由于六三的位置不适当。", "【启示】六三远离震动的中心，他是一位有过失的人。这场运动虽然离他的居所较远，却使他很害怕。可正是由于因惧怕使他得以自省改过，所以不会有灾难。" ],
      3:[ "【原文】象曰：震遂泥，未光也。", "【译文】象辞说：惊雷坠入淤泥里，是因为还没有光大。", "【启示】九四有雷入泥中的形象。九四的引申义可以从两个方面来解释。一是九四为国家重臣之位，所以在严打运动中尽管他受到了牵连，但是由于他位高权重，又与六五君王相合，所以法律无法制裁他。另一方面是，九四想以严法治国，可是他宣扬的法律威胁到了九五的君王，所以这种法无法实施，就像雷入泥潭一样。" ],
      2:[ "【原文】象曰：震往来厉，危行也。其事在中，大无丧也。", "【译文】象辞说：在震动中来回奔跑有危险，因为这是危险的举动。虽然有困扰但由于六五居中，所以没有大的损失。", "【启示】六五身为君位，可是初六的震动也使他产生了惊惧，并且来自九四的震动虽然没有大的发作，却也是隐藏的一种危机。虽然这两方面的震动对君王威胁不大，可是六五阴柔力弱，所以他四处躲闪，害怕给自己造成伤害。如果国君内心摇摆不定，那么对国家及国君本身是有危险的。" ],
      1:[ "【原文】象曰：震索索，未得中也。虽凶无咎，畏邻戒也。", "【译文】象辞说：雷声使人们瑟瑟发抖，是因为上六没有居中。虽然凶险但没有灾难，是从邻居的惊险中感到惊惧而有所戒备。", "【启示】九四的雷声没有响起来，初九的雷震到了上六已经力量很弱了，所以上六没有受到大的震动。可是上六阴柔无力，处于老弱状态，所以这一丝震动也让上六非常惊慌，六神无主。这么虚弱胆小的上六自然不适合带兵征讨别人了，由于运动的本身不是针对上六而来的，所以上六不会有灾难，只是他的配偶会责怪他胆小。" ]
    },
    yunshisuduan: [
      "震卦运势速断",
      "运势—六冲卦，大好大坏之象。有变动、动荡、不安、有惊无险之象。",
      "事业—在转折的关头，面临危险，在突发事件中应泰然处之，以便迅速复原。",
      "爱情—有虚无实，是非多杂。常有变动争吵，可能出现变故，应冷静处理。",
      "疾病—多为神经系统或急性肝病，病情反复，血气攻上，宜往西南方求医。",
      "经商—处于变动中。变动中容易获得权力或财富，但稳定后容易消失。",
      "诉讼—口舌争辩中可能有惊扰，事态多反复。",
      "出行—身难动，有二三人在途遇同伴，可以平安而归。",
      "人生—聪明好动、活跃而暴躁。容易打架或伤害他人，婚姻中容易吵闹。"
    ],
    chushizhidao: [
      "代表雷声不断，惩戒邪恶",
      "得此卦者声威显赫",
      "震象征打雷、地震。得震卦者多有受惊、变动，人人恐惧，此时要从容镇静，不可慌张失措。春雷虽然反映了春的威势和功勋，但别以为已经干出了惊天动地的伟业，与司晨的公鸡一样，功成身退才可以给人留下好念想。"
    ]
  },
  45: {
    name: "第32卦 恒：雷风恒卦",
    img: "32",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表不动摇，坚持不懈",
      "得此卦者不可虎头蛇尾",
      "恒象征持之以恒，动机纯正并持之以恒便会成功。“恒”有两个含义：不动摇，坚持不懈。得恒卦者，主旨是增加才德，而不是做事。与人共事方面应具有平衡的能力，起到“和稀泥”的作用。适合从事内部工作，而不是外勤。"
    ]
  },
  46: {
    name: "第40卦 解：雷水解卦",
    img: "40",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表在险中行动，如病初愈",
      "得此卦者已经显现转机",
      "解就是释放，脱离险地后要回到初始状态才能休养生息。得解卦者可驱散乌云见太阳，全部烦愁瞬间消。没有解不开的死结，不必在使气斗胜上折磨身心。相逢一笑泯冤仇，如果变被动为主动，会功到自然成。"
    ]
  },
  47: {
    name: "第62卦 小过：雷山小过卦",
    img: "62",
    guayao: [
      "小过，亨，利贞，可小事，不可大事。飞鸟遗之音，不宜上宜下，大吉。",
      "上六：弗遇过之，飞鸟离之，凶，是谓灾眚。",
      "六五：密云不雨，自我西郊，公弋取彼在穴。",
      "九四：无咎，弗过遇之。往厉必戒，勿用永贞。",
      "九三：弗过防之，从或戕之，凶。",
      "六二：过其祖，遇其妣；不及其君，遇其臣；无咎。",
      "初六：飞鸟以凶。"
    ],
    guayaoyi: [
      "小过卦，亨通，利于守正道。可以做小事情，不可做大事情。飞鸟遗有余音，不宜向上飞，宜于向下飞，大吉祥。",
      "上六：没有相遇而是超过了，飞鸟被网住，凶险，这真是灾祸。",
      "六五：阴云密布却没有下雨，从我的西郊压过来。王公用带绳子的箭射猎物，从洞穴中把猎物捉到。",
      "九四：没有灾难。不要越过，可以相遇，前往有危险一定要戒备，不要过于执著于正道。",
      "九三：没有过失也应加以防范，一味跟从别人会有凶险。",
      "六二：越过祖父，遇到祖母。没有赶上君王，却见到了君王的臣子，没有灾难。",
      "初六：飞鸟带来了凶险。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】小过，亨，利贞，可小事，不可大事。飞鸟遗之音，不宜上宜下，大吉。",
          "彖曰：小过，小者过而亨也。过以利贞，与时行也。柔得中，是以小事吉也。刚失位而不中，是以不可大事也。有飞鸟之象焉，有飞鸟遗之音。不宜上宜下，大吉；上逆而下顺也。",
          "象曰：山上有雷，小过；君子以行过乎恭，丧过乎哀，用过乎俭。"
        ],
        [
          "【译文】小过卦，亨通，利于守正道。可以做小事情，不可做大事情。飞鸟遗有余音，不宜向上飞，宜于向下飞，大吉祥。",
          "彖辞说：小过卦，是小的通过而亨通。通过守正道则有利，因为这是与天时一起运行。卦中柔爻居中而有阳爻的帮助，所以做小事有吉祥。刚爻不得位而且不居中，所以不可以做大的事情。卦象有飞鸟的形象，所以飞鸟遗有余音。不宜向上飞，宜于向下飞，大吉祥，是因为向上为逆，向下为顺的缘故。",
          "象辞说：山上响起惊雷就是小过的卦象。君子因此得到启示：行为要再谦逊一些，办丧事要再悲哀一些，花销要再节俭一些。"
        ],
        [
          "【启示】过是经过、度过、过度、超越的意思。小过卦象征小有过越，在小有过错的时候，适合做阴柔、柔小的事，以柔克刚，谦恭卑柔的心态可以改变局面。向上行大志则易违逆，向下施行小事则会安顺。向上过越则凶险，向下过越则吉祥。大过卦与小过卦的区别主要在于“大”与“小”的差异。",
          "从卦象上看，小过卦像一只飞鸟，中间两个阳爻为鸟身，上下四个阴爻为展开的鸟翅，所以有小鸟飞过的形象。从内外卦看，外卦为震为雷，内卦为艮为山，山顶响惊雷。此时，小的过错太多，或稍微有些过分。山顶的雷声比平地上的要响亮，这喻示着对过错的警示。卦中阴爻代表小人，他们包围着阳爻，且数量多于阳爻，为小人猖獗得意。此时不可勉强解决大问题，按顺序处理小问题最重要。低调处事为吉。",
          "得此卦者，工作、事业、婚恋容易走错路，需要再次努力。求财应迟。预测婚姻，虽有碍有疑但终可成，虽成又有不和。不应做大事、走大路，做事情要步步小心，走小路才能取得成功。"
        ]
      ],
      6: [
        "【原文】象曰：飞鸟以凶，不可如何也。",
        "【译文】象辞说：飞鸟带来了凶险，是没有办法解救的。",
        "【启示】处于小过之始，不宜有所行动，若一个劲地往前飞而不知道往回飞，势必会折断翅膀坠落于地。初六的凶险与花木兰的故事有些相似。初六处于社会下层，归隐于山林，与世无争。也许就在他午睡的时候，王公射中的一只飞鸟落在了初六的屋前，王公前来寻鸟，结果就会发现这位隐士，如果这位隐士是不辞而别来深山归隐的，肯定就会有凶险了。这种凶险是无法防范的。"
      ],
      5: [
        "【原文】象曰：不及其君，臣不可过也。",
        "【译文】象辞说：没有赶上君王，是因为臣子是不能超过君王的。",
        "【启示】六二的功业超过了自己的祖辈，但没有受到君王的奖赏。没办法他只得因君王大臣的帮助而获取一个官位了。如果他的功业太大超过了君王，那么肯定就会有灾难了。正是由于他的功业还不是太大，并且能够甘居于下，所以才“无咎”。"
      ],
      4: [
        "【原文】象曰：从或戕之，凶如何也。",
        "【译文】象辞说：一味跟从别人，这种凶险怎么办呢？",
        "【启示】为诸多阴柔小人所忌恨，不断受到他们的加害。遗憾的是九三有致命弱点，自恃强盛，不把那些小人放在眼里，既不屑于谨小慎微，也不屑于严加防备，大意失荆州，大难临头而不自知，所以才遭到戕害。在官场上如果盲目地跟着别人混会很凶险。因为自己不能把握自己的命运，自己不分辨是非，怎么能不危险呢？"
      ],
      3: [
        "【原文】象曰：弗过遇之，位不当也。往厉必戒，终不可长也。",
        "【译文】象辞说：不要越过，可以相遇，是因为九四处的位置不当。前往有危险一定要戒备，说明最终不会长久。",
        "【启示】不会有灾难，因为可以得到六五的帮助。但危险也是来自于六五，功高盖主便会受到君王的猜忌，所以九四不能有继续上升的想法，必须心怀戒备，不可施展才用。九四阳居阴位，不为过刚，于是能够遇合下卦之初，不会招致咎害。"
      ],
      2: [
        "【原文】象曰：密云不雨，已上也。",
        "【译文】象辞说：阴云密布却没有下雨，是因为阴云已经向上飘去。",
        "【启示】高高在上，但是下无应，这时是不能大有作为的。身处人君之位，虽不能施惠天下万物，但是作为一个王公贵族尚可以稍稍过行其职，竭力除害，矫正弊端。"
      ],
      1: [
        "【原文】象曰：弗遇过之，已亢也。",
        "【译文】象辞说：没有相遇而是超过了，这是说上六已居亢极之高位。",
        "【启示】小过卦描述的是乱世时期，所以一切都应当“宜下不宜上”。君王应当向下恩泽民众，重新取信于民；臣民亦应当向下归隐于山林避难。可是上六处于极亢之位，所以高飞而不下，结果导致凶险。这是不识时务造成的。"
      ]
    },
    yunshisuduan: [
      "小过卦运势速断",
      "运势—小有不顺，或被打压，忌冲动犯上。应做小事，不应做大事。",
      "事业—行动应谨慎小心，步步为营，知退守则吉。不可冒险或钻营。",
      "爱情—相处有障碍，常生口角，有去外地之象。虽可成功但最终又不和。",
      "疾病—病在神经，行动不变，食物不落，心痛腹痛，宜向往东南方求医。",
      "经商—改行、开业不利。应稍试探便收敛。不应大规模行动，应逐步发展。",
      "诉讼—有人作梗，宜和解，和解则没有损失。",
      "出行—会忧疑，破财后方能行动；或者在外有阻，事情反复。",
      "人生—具有两面、多变性格。仕途上寻求靠山，会当秘书。"
    ],
    chushizhidao: [
      "代表小有过错，不应做大事",
      "得此卦者要留有余地",
      "小过指小的过度、小过错。得小过卦者虽是守成之才，但难成大气候。得大过卦者善治国，得小过卦者善持家。所以得小过卦不可做大事，应该做小事。务实地规划可得顺利，做事留有余地才能保证安全。"
    ]
  },
  48: {
    name: "第16卦 豫：雷地豫卦",
    img: "16",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表悠然自得，安逸享受",
      "得此卦者不要滋生怠惰",
      "豫象征一片和乐的景象。得豫卦者不要为物所累、片面追求“大”而“全”。志可得，意不可满，不要消磨掉锐气、进取心，有童心才能有生命力，时机一到就应该立即行动。如果陷入怠惰，便将失去大势。"
    ]
  },
  // 5
  51: {
    name: "第9卦 小畜：风天小畜卦",
    img: "9",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表小有积蓄，不可贪大",
      "得此卦者要利益均沾",
      "小畜表示企图心旺盛，但力量不足，需要休养生息。得小畜卦者不可贪大，在时机未成熟时需要自我克制，蓄养精神，积蓄力量，争取支援。虽暂时没有下雨，但时机一到雨必下。"
    ]
  },
  52: {
    name: "第61卦 中孚：风泽中孚卦",
    img: "61",
    guayao: [
      "中孚，豚鱼吉，利涉大川，利贞。",
      "上九：翰音登于天，贞凶。",
      "九五：有孚挛如，无咎。",
      "六四：月几望，马匹亡，无咎。",
      "六三：得敌，或鼓或罢，或泣或歌。",
      "九二：鸣鹤在阴，其子和之，我有好爵，吾与尔靡之。",
      "初九：虞吉，有他不燕。"
    ],
    guayaoyi: [
      "中孚卦，对小猪小鱼都有诚信所以吉祥，利于跋涉大川险阻，利于守正道。",
      "上九：鸡飞向天空，守正道凶险。",
      "九五：用诚信联系天下，没有灾难。",
      "六四：月近十五，马匹丢了，没有灾难。",
      "六三：攻克了强敌，有的擂鼓有的休息，有的哭泣有的歌唱。",
      "九二：鹤在树阴下鸣叫，小鹤在旁边跟着鸣叫。我有上好的美酒，与你共同分享。",
      "初九：考虑好再做事吉祥，有其他的猜疑会导致不安。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】中孚，豚鱼吉，利涉大川，利贞。",
          "彖曰：中孚，柔在内而刚得中。说而巽，孚，乃化邦也。豚鱼吉，信及豚鱼也。利涉大川，乘木舟虚也。中孚以利贞，乃应乎天也。",
          "象曰：泽上有风，中孚；君子以议狱缓死。"
        ],
        [
          "【译文】中孚卦，对小猪小鱼都有诚信所以吉祥，利于跋涉大川险阻，利于守正道。",
          "彖辞说：中孚卦，柔顺居于内，刚健的阳爻居中，喜悦而随顺，这种诚信可以感化万邦的民众。小猪小鱼的吉祥，是说对小猪小鱼也有诚信。利于跋涉大川，是因为可以乘坐木船过河。心中诚信利于守正道，因为这是顺应天道。",
          "象辞说：泽上有风吹过便是中孚卦的卦象。君子从卦象中受到启发，以忠信之德审判犯人，尽量不处死罪犯。"
        ],
        [
          "【启示】中孚之意为诚信、真诚。“孚”字原为“孵”字，鸟孵卵有固定的日期，不能延误，小鸟应该多少天出生就必然在那天破壳。所以“孚”字有信守时间、承诺的意思。诚信十分重要。儒家提出了“仁、义、礼、智、信”五德，把仁排在第一位，信排在最后一位，不是说信不重要，而是说他是做人的道德底线，人不可以突破这个底线。",
          "从卦象上看，中孚卦的六爻组成一个符契的形象。古人订合同时将内容写在竹板上，然后把竹板断成两块，每人一块。当两块竹板能够完整地对在一起时，合同才可以生效。所以说符契是取信的证据。从内外卦看，泽上有风。这个风指信风，每年相同的时间，信风都会从同一个方向吹来，这是风的诚信。",
          "卦辞说：“君子以议狱缓死”，意为尽量不处死罪犯。罪犯虽然罪孽深重，但如果他们在受刑前有了悔改的诚意，想重新做人，为什么不能相信他们一次呢？所以应“缓死”。君子的诚信之德要无所不施，对犯人也不例外。",
          "此卦始凶后吉，主吉象。得此卦者应正直而诚信，不得虚伪。如果此卦为本卦，变而成其他卦，多为事不成之兆；反之，如果此卦由其他卦变来，则多为可成，但有口舌。"
        ]
      ],
      6: [
        "【原文】象曰：初九虞吉，志未变也。",
        "【译文】象辞说：初九考虑好再做事吉祥，是因为没有改变自己的意志。",
        "【启示】做事考虑好再做，自然可以避免危险。如果有其他的想法，改变了初衷便会导致不安了。初九的想法很简单，便是忠实于六四。如果初九不再忠诚于六四，那么他的处境就不好了。因为从卦象上分析，他只与六四有应。"
      ],
      5: [
        "【原文】象曰：其子和之，中心愿也。",
        "【译文】象辞说：小鹤在旁边跟着鸣叫，是心中真诚的愿望。",
        "【启示】大鹤与小鹤的鸣声相应，这便是一种父子或母女之间的诚信。也有人认为是雌鹤与雄鹤的鸣声相和，表达了雌雄之间的诚信。九二只与六三阴阳相合，所以他必须对六三忠诚，如果不对六三忠诚，他便再也寻不到忠诚的朋友了。所以说，忠诚是相互的，人心换人心，这样才能体现出诚信的意义。"
      ],
      4: [
        "【原文】象曰：或鼓或罢，位不当也。",
        "【译文】象辞说：有的擂鼓有的休战，是因为六三居位不当所以存心不诚。",
        "【启示】六三的言行系诸外物，而且不自量力，杂念太多，投机钻营，将徒劳无益。六三爻辞又是一首古歌，文字简练，形象生动。描写的是打了胜仗归来的情景。有的击鼓庆贺，有的疲乏了在休息，有的兴奋得在哭（或为死去的战友而哭），有的在纵情高歌。这个画面表达了战友之间的友谊与忠诚，而其最大的忠诚则是对国家的忠诚。"
      ],
      3: [
        "【原文】象曰：马匹亡，绝类上也。",
        "【译文】象辞说：马匹丢了，是六四断绝同类而上承九五。",
        "【启示】如果地位达到极盛的程度，以至于与九五相匹敌，就会引起九五的不快，受到九五的制裁。六四一方面上承九五，一方面又下应初九，面临着一种痛苦的选择。可是最终只能选择忠实于九五的君王，这就是忠孝不能两全，他必须舍家保国。"
      ],
      2: [
        "【原文】象曰：有孚挛如，位正当也。",
        "【译文】象辞说：用诚信联系天下，是因为九五居中而得位。",
        "【启示】九五为中孚卦之卦主。身为尊贵之君，必须能使诚信之德施及天下。欲得为君之道，须有中正之德和至诚至信之心，从而使天下人都能以诚信相通。唐太宗的“纵囚归狱”的故事便能说明这个道理。唐太宗对死刑犯讲诚信，死刑犯也对唐太宗也讲诚信，结果是天下大治。"
      ],
      1: [
        "【原文】象曰：翰音登于天，何可长也。",
        "【译文】象辞说：鸡飞向天空，怎么能飞得长久呢？",
        "【启示】诚信之德已衰，虚伪则随之生出。声音飞得越高，越显得虚无缥缈。上九缺乏的就是至诚至信之心与笃实之道，忠笃内丧，华美外扬，一味地追求虚名，以矫揉虚伪为尚，这种华而不实的人是不会有所作为的。"
      ]
    },
    yunshisuduan: [
      "中孚卦运势速断",
      "运势—泽水相应而起波浪，为共鸣之象。诚信则吉，利于他乡财路。",
      "事业—不可以孤傲的性格自我封闭。真诚守信，和悦谦虚，可亡羊补牢。",
      "爱情—结局吉，双方以诚相待可成良缘。男性得此卦有左右逢源之象。",
      "疾病—小凶之象，腰部、下腹部容易得病。可往东南方求医。",
      "经商—讲究信义，保质保量则吉，甚至冒险犯难也不会出问题。",
      "诉讼—飞来之事，宜速速处理，如果延迟则有损伤。",
      "出行—会遇到其他人，凡事方便、顺利。",
      "人生—适合在政法、医院工作，多为中级干部，执掌过渡性的权力。"
    ],
    chushizhidao: [
      "代表信守承诺，感化万物",
      "得此卦者要守信用",
      "中孚指孵卵不能延误时日，此时要守信，或教化他人时要守信。得中孚卦者往往很诚信。“信”是人的道德底线，人不可以突破这个底线。持中守信则身和、家和、国和、天下和。"
    ]
  },
  53: {
    name: "第37卦 家人：风火家人卦",
    img: "37",
    guayao: [
      "家人，利女贞。",
      "上九：有孚威如，终吉。",
      "九五：王假有家，勿恤吉。",
      "六四：富家，大吉。",
      "九三：家人嗃嗃，悔厉吉；妇子嘻嘻，终吝。",
      "六二：无攸遂，在中馈，贞吉。",
      "初九：闲有家，悔亡。"
    ],
    guayaoyi: [
      "家人卦，有利于女人守正道。",
      "上九：有诚信有威望，最终吉祥。",
      "九五：君王治国就像治家一样，不要忧愁，吉祥。",
      "六四：家庭富裕，大吉大利。",
      "九三：家里人被训斥，治家严厉吉祥；妇女、孩子嘻嘻哈哈，最终会有忧吝。",
      "六二：不自作主张，到了中午开始吃饭，守正道吉祥。",
      "初九：在家中做好防范，不会发生悔恨的事情。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】家人，利女贞。",
          "彖曰：家人，女正位乎内，男正位乎外，男女正，天地之大义也。家人有严君焉，父母之谓也。父父，子子，兄兄，弟弟，夫夫，妇妇，而家道正；正家而天下定矣。",
          "象曰：风自火出，家人；君子以言有物，而行有恒。"
        ],
        [
          "【译文】家人卦，有利于女人守正道。",
          "彖辞说：家人卦，女子（指六二）得位居中于内卦，男子（指九五）得位居中于外卦，男女的位置正确，这是符合天地的礼义。家里面严肃的君长，便是父母。父亲像父亲，儿子像儿子，兄弟像兄弟，丈夫像丈夫，妻子像妻子，这样的治家之道才是正确的。这种治家之道可以使天下安定（即也是治国之道）。",
          "象辞说：风从火中生出，这就是家人卦的卦象。君子从中受到启示，说话要讲究实际，做事要持之以恒。"
        ],
        [
          "【启示】上面的明夷卦代表受伤，人受伤后便会回到家中养伤，所以明夷卦之后是家人卦。家人就是家里人，卦辞极其简单，只有三个字——利女贞。这三个字却说出了家庭中女人的重要作用。俗话说“妻贤夫祸少”，家庭和睦的关键是女人是否贤惠。家庭以主妇的角色为重。主妇正则全家正；主妇不正则全家不正。妇女在家有大权，家庭的平和与否通常由女性操纵，如婆媳、姑嫂之间的问题等。如果主妇固守自己的岗位，安慰丈夫，教养孩子，事事以家人为重，家庭便和睦安宁。",
          "治家之道，男子要严厉，女子要柔顺。治家也应该有不同的分工。男子齐家的目的是治国平天下，所以对男子的要求是在家外居正当之位，这是齐家的需要，也是治国的需要。女主家内事，男主家外事，家庭问题就解决了。家道正才能治国，治国才能平天下，由此可见正家道是正天下之本。",
          "家人卦认为家庭里要有尊卑次序。西方人讲究平等，却有许多弊端。他们的孩子因为强调平等而毫无顾忌，许多人不尊重长辈，学生可以凌驾于老师之上，子女可以凌驾于父母之上。而中国人讲尊卑，好像不平等，实际上并非如此。父尊子卑，因为父亲岁数大，社会经验丰富，又对子女有养育之恩，那么子女就应该尊重父亲。而且这也是会变的，等儿子将来做了父亲，自然就成为尊者，他的子女就要尊重他。",
          "得此卦者，遇到困难可得家人之助。预测婚姻可成。预测事业，要先成家后立业，借助家庭力量才能有所作为。家人团结、夫妻和睦、孝顺长辈是最有利的因素。"
        ]
      ],
      6: [
        "【原文】象曰：闲有家，志未变也。",
        "【译文】象辞说：在家中做好防范，是对家的观念没有改变。",
        "【启示】刚建立家庭就要防止邪恶，如果一开始就约束不严，放任自流，等到家风败坏再加以管教，将难以收拾。远古时代的房屋虽然简陋，但却都有院落。院子的大门像两片木栅栏，关上门后插上一根横木，外面的人就进不来了。这根横木就叫做“闲”。这根横木还可以当武器用，进行自卫。"
      ],
      5: [
        "【原文】象曰：六二之吉，顺以巽也。",
        "【译文】象辞说：六二之所以吉祥。",
        "【启示】妻子在家中不是一家之主，所以做事不能擅自做主，有事要与丈夫商量。而妻子在家中主内，主要任务便是给一家人做饭，每天中午给家中人准备好可口的饭菜，听从丈夫的命令，守持正道，就会吉祥。这个吉祥，既是六二的吉祥，同时也是一家人的吉祥。"
      ],
      4: [
        "【原文】象曰：家人嗃嗃，未失也；妇子嘻嘻，失家节也。",
        "【译文】象辞说：家里人被训斥，是没有失去家法；妇子、孩子嘻嘻哈哈，是失去了家的节制。",
        "【启示】虽得正却不居中，是个治家过严的家长。治家很严，严过头了，有伤感情。治家当然以适中为宜，然而在不能适中的情况下，与其过宽不如过严。过严虽然会产生一些副作用，但最终还是吉的。如果过宽，妇人小孩都嘻皮笑脸无所畏惧，就会乱伦礼，生邪恶。"
      ],
      3: [
        "【原文】象曰：富家大吉，顺在位也。",
        "【译文】象辞说：家庭富裕大吉大利，是因为六四爻柔顺而得位。",
        "【启示】在一个家庭中，父是主管教化的，负责礼仪表率；母是主管饮食的，负责日常安排，勤俭则日富，奢侈则日贫。勤俭持家，不免聚敛，从而招至怨尤。六四柔顺而得位，与其下的初九相应，故能为家庭带来财富和吉祥。"
      ],
      2: [
        "【原文】象曰：王假有家，交相爱也。",
        "【译文】象辞说：君王治国如治家，是让人们都像一家人一样相亲相爱。",
        "【启示】九五不是一般的家长，而是一个君王，有代表性、权威性。君王以自己的美德和模范行为来感动家人。家人受其感动，也都和睦相处。同样是治家，九五的治家之术比九三要高明。古代的天子是所有诸侯国的总盟主，所以要宣扬大统一的思想。并且不单是从思想上进行宣传，而且通过联姻的关系促成大统一的格局。比如纣王的父亲见西周强盛了，便把自己的同宗妹妹嫁给了周文王的父亲。"
      ],
      1: [
        "【原文】象曰：威如之吉，反身之谓也。",
        "【译文】象辞说：有威望的吉祥，说的便是能反身自律。",
        "【启示】上九是家庭中位置最高的人物，就相当于国家的太上皇，民间家庭的老太爷。这些老人受到下面家庭成员的普遍尊重。所以上九必须不负众望，要有诚信有威望。按现在的话来说就是要老而有德。中国历来尊重老年人，可是如果老人无德，便会失去应有的尊重了。"
      ]
    },
    yunshisuduan: [
      "家人卦运势速断",
      "运势—风助火势，火助风威，可与家人协力发展事业，与他人合作也易成。",
      "事业—成功与否与家庭支持密切相关。应严格治家，防止“后院起火”。",
      "爱情—大吉之象，终成美眷。妻子是家道的根本，择妻应慎重。",
      "疾病—若为腹部之病不严重，若为心脏病则危重，可往东南方求医。",
      "经商—以治家的方式来经商，集中权力，严宽结合，以严为主。",
      "诉讼—我方得理，不过有疑虑，但最终没有妨碍。",
      "出行—与姓名中有木的人同行，事情与女人有关，钱财上反复。",
      "人生—起步较晚。仕途应由“齐家”开始，结婚生子后才可有所发展。"
    ],
    chushizhidao: [
      "代表家里要有尊卑次序",
      "得此卦者要以和为贵",
      "未家人象征一家人和睦团结，相亲相爱。得家人卦者，家和则万事兴，家不和则外人欺，家丑不可外扬。父是父，子是子，家中要有明确的角色意识；男主外，女主内，治家应该有明确分工。济指渡河尚未成功，秩序混乱、时运不济就是“未济”。得未济卦者虽然混乱无序，但此时也是一个新开始的过渡期。这喻示着吉凶未定，使人对未来产生希望。如同种子刚刚播下，新的一次轮回开始了，一切都未确定。"
    ]
  },
  54: {
    name: "第42卦 益：风雷益卦",
    img: "42",
    guayao: [
      "益，利有攸往，利涉大川。",
      "上九：莫益之，或击之，立心勿恒，凶。",
      "九五：有孚惠心，勿问元吉。有孚惠我德。",
      "六四：中行，告公从。利用为依迁国。",
      "六三：益之用凶事，无咎。有孚中行，告公用圭。",
      "六二：或益之十朋之龟，弗克违，永贞吉。王用享于帝，吉。",
      "初九：利用为大作，元吉，无咎。"
    ],
    guayaoyi: [
      "益卦，前往有利，有利于跋涉大川。",
      "上九：没有人增益它，有的人打击它，树立决心不够坚定，凶险。",
      "九五：有诚信惠心，不用问就知是大吉利，有诚信惠心于我的恩德。",
      "六四：行中庸之道，告诉王公的随从。利于依附强大的邦国而进行迁都。",
      "六三：用收到的礼物救助灾区，没有灾难。有诚信而行中庸之道，用圭璧为信物向王公告急。",
      "六二：有人送给价值十朋的大龟，不要拒绝，永远守正道吉祥。君王祭祀先帝，吉祥。",
      "初九：有利于发展大事业，大吉祥，没有灾难。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】益，利有攸往，利涉大川。",
          "彖曰：益，损上益下，民说无疆，自上下下，其道大光。利有攸往，中正有庆。利涉大川，木道乃行。益动而巽，日进无疆。天施地生，其益无方。凡益之道，与时偕行。",
          "象曰：风雷，益；君子以见善则迁，有过则改。"
        ],
        [
          "【译文】益卦，前往有利，有利于跋涉大川。",
          "彖辞说：益卦，减损上面，增益下边，民众喜悦无边，从上到下，道德被发扬光大。利有所往，因为九五爻居中正之位而有喜庆之事。利于跋涉大川，是因为木船可以在水上航行。益卦动而能柔顺，日新月异发展没有边际。天降甘露，地养育万物，增益是没有固定的方式的。凡属增益之道，是随着时序一起前进的。",
          "象辞说：风与雷组合在一起便是益卦的卦象。君子从中受到启示，向美善学习，改正自己的过失。"
        ],
        [
          "【启示】益通溢。器皿上面溢出水是“溢”字的形象。其引申义为增加、增益、增强。不停地减损就会出现损极而反的增益，所以损卦之后是益卦。此卦为由上对下的一种好的给予，主吉象。益卦和损卦要结合起来理解，如果想受益，必须先自损；如果一味求益，必然会受损。孔子对此曾经发出“自损者益，自益者缺”的感慨。",
          "从卦象上看，下动可获上应，能得到协助，也表示民主、和平的时代。益卦有“损上益下”的含义，与损卦象反。相对于国家来说，统治者能够减轻民众的徭役与税赋，便是损上益下之举。君王能够减损自己来补益民众，会得到民众的拥护。",
          "得此卦者，有受他人相助而得利之意。上级能使下级得到更多的利益，下级自然会拥护上级，从而巩固了上下级的团结，各方面均有增益。预测婚姻可成，男女感情相合，可增益子孙，或受其长辈照顾而有所得，相得益彰，相辅相成。但风雷激烈而身心受苦，住居不安宁，不慎短虑恐有惊动、意外的灾难或损失。占病有突发血光之灾。"
        ]
      ],
      6: [
        "【原文】象曰：元吉无咎，下不厚事也。",
        "【译文】象辞说：大吉祥没有灾难，是因为下民不用承受繁重的剥削。",
        "【启示】初九是成卦之主，为处下获益之象，发展是无限量的，利于大有作为。初九与六四相应，就好比六四设宴邀请初九，初九由于身边有事，所以做完手头的工作后便去赴宴，结果去得有些晚了，大家都已经吃得喝得只剩残局。这种损失，只是少喝点酒的损失，所以不会造成灾难。因为初九前去赴宴的目的，不是为了吃喝，而是为了与六四进行交往。"
      ],
      5: [
        "【原文】象曰：或益之，自外来也。",
        "【译文】象辞说：有人给予增益，是从外面得到增益。",
        "【启示】六二不安于现状，不满意的是凌驾于他上面的六三，所以他想排挤掉六三，这种想法与行动是凶险的。好比一个部门经理，本来他的直接领导是一位有才干的人，可是调走了，上面又派下来一个平庸之辈。这位部门经理便有些不服，想把这位新领导排挤走。这种行为肯定会遭到总经理的反对而不会成功。"
      ],
      4: [
        "【原文】象曰：益用凶事，固有之也。",
        "【译文】象辞说：用收到的礼物拯救灾区，可以巩固自己原有的利益。",
        "【启示】正当荒歉之年，不必做别的事，只要能开仓赈济灾民，就体现了损上益下之道，必无咎害。开仓济民要有诚信，既要有信于上，也要有信于下，持守中道，慎于行事，不可借赈灾之机中饱私囊。六三要向王公报告，获致批准方可开仓。粮食本来就是百姓耕种出来的，现在官府开仓赈灾，是取之于民用之于民。"
      ],
      3: [
        "【原文】象曰：告公从，以益志也。",
        "【译文】象辞说：告诉王公的随从，以增强众人的意志。",
        "【启示】居益卦上体，说的迁徙其国都、避害就利之举。在灾荒之年，损上益下之时，最大的益下举动莫过于迁国，带领人民到庶富之地去耕耘收获，重建家园。古人常有迁徙国都之事。六四虽然主于益下，但他不在君位，迁国大事须请示君主，依附君主实施迁国，无往不利。"
      ],
      2: [
        "【原文】象曰：有孚惠心，勿问之矣。惠我德，大得志也。",
        "【译文】象辞说：有诚信惠心，是用不着问的。（天下人）报答我的德行，可以达到更大的发展。",
        "【启示】以阳刚中正之德居尊位，下应六二，犹如怀有诚信惠下之心。天下之民受其恩惠，当然是不待问而必有吉祥，滴水之恩当以涌泉相报。九五以至诚益于天下，天下之人当然亦至诚爱戴，真心实意地回报其恩德。在九五看来，惠益下民是自己的心愿；在百姓看来，这就是赐予他们的恩德。损卦的六五是受下之益，益卦的九五是自损以益下，比较起来益卦的九五容易让人误解，益下也就益了自己。"
      ],
      1: [
        "【原文】象曰：莫益之，偏辞也。或击之，自外来也。",
        "【译文】象辞说：没有人增益它，是国内普遍的情况。有的人打击它，则是来自外部的。",
        "【启示】处益卦上体，本该像六四、九五那样坚持益下，但他益下之心不能恒久，反而要求损下益上，结果适得其反，陷入凶险的境地。六二不招自来的是益者，上九不招自来的是损者，是来攻击他的。从政治角度来看，就是统治者如对民取而不与，只是一味地侵夺和剥削，老百姓会起而反抗，甚至暴动。上九是一个贪得无厌、目光短浅的昏君。这是一个反面典型，用以警醒后人。"
      ]
    },
    yunshisuduan: [
      "益卦运势速断",
      "运势—强风配快雷，声威增长，正当吉运，可得贵人之助而成功。",
      "事业—勇敢前进，大胆投入，勇于支持他人事业，施善于人，会相得益彰。",
      "爱情—相成相益，可成良缘。有喜悦之象、发达之意。",
      "疾病—足或胃部疾病，有小血光但无碍，可治愈。应往东南方求医。",
      "经商—改行、开业有利可图。勿追求小利，让利于人则获丰厚利润。",
      "诉讼—与粮食田地等事物有关，处理不好有牢狱之灾。",
      "出行—三人同行，往东南方无险，财不旺。",
      "人生—无论男女都有阳刚之气，喜欢争权称王。善于维护自身权益。"
    ],
    chushizhidao: [
      "代表增加增强，可获上应",
      "得此卦者要讲究分流",
      "益表示得利，但不可能永远得利，诚信和善良才能不失根本。得益卦者，损己益人必然会得到回报。大家都追求各自的利益，难以实现利益的最大化。大家追求共同利益则会有意外的收获。"
    ]
  },
  55: {
    name: "第57卦 巽：巽为风卦",
    img: "57",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: [
      "巽卦运势速断",
      "运势—六冲卦，大好大坏之象。多波折，游离不定，应随机应变。",
      "事业—谦虚处世，会受到同辈欢迎和上级重视。但不可懦弱和虚伪。",
      "爱情—时好时坏，轻飘不实，把戏不少，风波已生，不可轻率。",
      "疾病—久病则凶，且病情多变。多为糖尿病、胃肠病等，宜往西南方求医。",
      "经商—开业可行，但不可急。易有变动。应以谦逊的态度行事。",
      "诉讼—能和能散，是当前的形势。宜和解，和解则会有贵人。",
      "出行—若无口舌，便有虚惊。宜二人同行，应速出行，不利北方。",
      "人生—性格飘忽不定，不愿深入思考，容易接受随风而来的新思潮。"
    ],
    chushizhidao: [
      "代表柔软适应，变化莫测",
      "得此卦者万事皆可享通",
      "巽指风吹大地，风跟随着风。此时要顺从，但不可盲从，要顺从正人君子。得巽卦者如同风一样无孔不入、能聚能散，可以不断调整自己来顺应环境的变化。但不要陷入无原则性的危险中，优柔寡断则会进退两难。"
    ]
  },
  56: {
    name: "第59卦 涣：风水涣卦",
    img: "59",
    guayao: [
      "涣，亨。王假有庙，利涉大川，利贞。",
      "上九：涣其血，去逖出，无咎。",
      "九五：涣汗其大号，涣王居，无咎。",
      "六四：涣其群，元吉。涣有丘，匪夷所思。",
      "六三：涣其躬，无悔。",
      "九二：涣奔其机，悔亡。",
      "初六：用拯马壮，吉。"
    ],
    guayaoyi: [
      "涣卦，亨通。君王来到宗庙祭祀先祖，有利于跋涉大川，利于守正道。",
      "上九：流血后，远离伤害，没有灾难。",
      "九五：浩瀚无边的大水袭来，人们大声呼喊，水流到了王宫附近，没有灾难。",
      "六四：水波冲击着人群，大吉祥。水中的人群聚为山丘，不是常人能够想到的。",
      "六三：水波冲击着身体，没有悔恨。",
      "九二：水波冲到岸边的台阶上，没有悔恨。",
      "初六：用来拯救的马匹强壮，吉祥。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】涣，亨。王假有庙，利涉大川，利贞。",
          "彖曰：涣，亨。刚来而不穷，柔得位乎外而上同。王假有庙，王乃在中也。利涉大川，乘木有功也。",
          "象曰：风行水上，涣；先王以享于帝，立庙。"
        ],
        [
          "【译文】涣卦，亨通。君王来到宗庙祭祀先祖，有利于跋涉大川，利于守正道。",
          "彖辞说：涣卦亨通。刚爻来到下边的九二处而不穷困。柔爻来到六四的位置与九五爻相合。君王来到宗庙，是君王来到居中的位置。有利于跋涉大川，是乘着木船可以顺利到达彼岸。",
          "象辞说：风吹在水面上就是涣卦的卦象，先王从中受到启发，祭祀先帝，设立宗庙。"
        ],
        [
          "【启示】涣本意指水流分散，引申义为涣散、离散，主凶象。也表示民心反离、分裂。涣散不完全等于凶险，事物的发展往往是有散有聚的，散与聚是互相依存的辩证关系。水聚集于湖中，蒸发为水汽，这是散；但是雨又给湖泊补充了新的水源，这是聚。人与人、每个组织之间都经历过有散有聚的过程，原有的形态在完成特定性的使命后终将瓦解，而新的关系又将逐步确立。涣散促使陈旧制度瓦解，而孕育着新事物的诞生。关键是要抓住机遇，拯救涣散，促使其向聚合的方向转化。",
          "涣卦所描述的便是人类大迁移的场面。远古人类发明了舟楫，于是离开故居，漂洋过海，流散到世界各地。如美洲的印第安人便是从我国流散过去的移民。迁移更有利于生存，所以亨通。来到新的居住地后，部落酋长第一件事便是要建宗庙，因为宗庙祭祀可以团结民众，所以这是最重要的事。",
          "得此卦者会有任性、放纵的性格。求财难成，有不测之灾或蒙受损失，也有住居劳苦之象。我难彼顺，有颓废不振的运势。陷入困难，涣散溃败，向心力丧失，离心力增加。事业、感情、婚姻的根基开始松动，内部有不和，导致人们心神不宁、精神不佳，心绪沉闷。应稳定情绪、定下心神，在不稳定的情况下坚持主见，或远方交涉，或迁居，收拾涣散之局，重整聚合。"
        ]
      ],
      6: [
        "【原文】象曰：初六之吉，顺也。",
        "【译文】象辞说：初六的吉祥，是因为具有柔顺的美德。",
        "【启示】涣散刚刚开始，拯救起来还比较容易。初六处于迁移的初级阶段，人们走得累了，可以骑着马继续前进，寻找着自己的乐土。这是交通工具给人类的迁移带来的吉祥。如果没有先进的交通工具，人类靠两只脚是无法走到世界各地的。因为有大山与海河阻挡着。"
      ],
      5: [
        "【原文】象曰：涣奔其机，得愿也。",
        "【译文】象辞说：水波冲到岸边的台阶上，是九二与初六达成了相合的心愿。",
        "【启示】涣散之时奔向可供凭依的几案，说明九二得遂阴阳相聚的愿望。九二处在涣散之时，凭着自己如壮马般的才力，不去拯救涣散。与其救而无功，不如急速离开危境到安稳的地方去。哪里是安稳之地呢？九二把初六看做可以安居之地。九二处涣散之时而急就于初六，得以实现阴阳相聚的愿望。"
      ],
      4: [
        "【原文】象曰：涣其躬，志在外也。",
        "【译文】象辞说：水波冲击着身体，说明六三爻的志向是向外发展。",
        "【启示】水冲击着身体，这个身体应当是舟的体表，人们乘舟远行了。波涛拍打着船舷。人们在茫茫的水面上航行，这水有可能是海水，也有可能是湖水，也有可能是河水，总之，他们在朝一个陌生的国度前进。这不应当悔恨。尽管前面的乐土也许是别人的领地，那么继续向别的地方行进，寻找自己的乐土。"
      ],
      3: [
        "【原文】象曰：涣其群，元吉；光大也。",
        "【译文】象辞说：水波冲击着人群，大吉祥，是团结的力量得到了发扬光大。",
        "【启示】六四作为一个公正无私的大臣，不仅能够解散自己的朋党，使国家大吉，而且还能解除各种有碍统一的小群割据势力，涣散小群而重新聚合如山丘般的国家。做到这一点是很不容易的，这不仅要求六四自身素质要好，能大公无私，还要有政治抱负、政治远见。"
      ],
      2: [
        "【原文】象曰：王居无咎，正位也。",
        "【译文】象辞说：王宫没有灾难，是因为九五居中而得位。",
        "【启示】当身体郁结风寒时，若能发一场大汗，病就好了。国家、社会也是如此，积弊久了，会出现各种问题，这时也需要“发汗”，将长期淤积壅滞的各种弊端一扫而尽。所以用“发汗”来比喻君王号令很恰当。六四只是执行号令的大臣。当机立断发布号令的是九五。有这样一位具有远见卓识的领导者坐阵指挥，又有六四这样无私干练的大将来贯彻执行，定可拯涣成功。"
      ],
      1: [
        "【原文】象曰：涣其血，远害也。",
        "【译文】象辞说：流血后，就应当吸取血的教训远离伤害。",
        "【启示】经过各爻的努力，大乱达到了大治，大散达到了大聚，终于达到了治涣的目的。故上九能远离伤害。涣散瓦解了旧观念、旧制度，同时也就孕育了新观点、新制度。拯治涣散的最好办法莫过于使用涣散的手段，以其人之道还治其人之身，散尽朋党，解除割据，国家自然由散而聚。"
      ]
    },
    yunshisuduan: [
      "涣卦运势速断",
      "运势—有冰雪消解之意。初有小损失，但终可解困。忌任性、放纵、散慢。",
      "事业—人心不齐，要去除私心，牺牲小我。不可介入争端，应力求重获安定。",
      "爱情—因小障碍、外在因素而离散，但情缘仍在，可能复合。",
      "疾病—病不稳定，有险象，但有解。起初体弱多病，多为逐渐康复之象。",
      "经商—起初有损失和波折，但可渐入佳境。目标准确则有利，可适当冒险。",
      "诉讼—宜缓不宜急，有第八个人和解，或不成事。",
      "出行—身已动又回。若寻人，之前有信息则不可确定，而后有信息可速动。",
      "人生—有强烈的权利欲望，有领导才能。做事情容易有所成就。"
    ],
    chushizhidao: [
      "代表涣散分裂，民心反离",
      "得此卦者要随遇而安",
      "涣指涣散，但不完全等于凶险，此卦凶中藏吉，同心同德则可化险为夷。得涣卦者如同风行水上，平地要起波澜。没有不散的筵席，好朋友也不能厮守一生。情缘将尽，猜疑已生，间隙已成，不要最终闹个不欢而散。"
    ]
  },
  57: {
    name: "第53卦 渐：风山渐卦",
    img: "53",
    guayao: ["渐，女归吉，利贞。", "上九：鸿渐于陆，其羽可用为仪，吉。", "九五：鸿渐于陵，妇三岁不孕，终莫之胜，吉。", "六四：鸿渐于木，或得其桷，无咎。", "九三：鸿渐于陆，夫征不复，妇孕不育，凶；利御寇。", "六二：鸿渐于磐，饮食衎衎，吉。", "初六：鸿渐于干，小子厉，有言，无咎。"],
    guayaoyi: ["渐卦，女子出嫁吉祥，利于守正道。", "上九：大雁渐渐飞到陆地上，它的羽毛可用于礼仪饰品，吉祥。", "九五：大雁渐渐飞到山陵上，妇女三年不能怀孕，最终没有人欺凌她，吉祥。", "六四：大雁渐渐飞到树上，有的飞到屋顶上，没有灾难。", "九三：大雁渐渐飞到陆地上，丈夫出征没有回来，妇女怀孕却流产了，凶险。但有利于抗击盗寇。", "六二：大雁渐渐飞到磐石上，饮食和乐，吉祥。", "初六：大雁渐渐飞到了水边，小雁有危险，被大雁叫住，没有灾难。"],
    guaciyaoci: {
      0: [
        [ "【原文】渐，女归吉，利贞。", "彖曰：渐之进也，女归吉也。进得位，往有功也。进以正，可以正邦也。其位刚，得中也。止而巽，动不穷也。", "象曰：山上有木，渐。君子以居贤德，善俗。" ],
        [ "【译文】渐卦，女子出嫁吉祥，利于守正道。", "彖辞说：逐渐前进，就如同女子出嫁循礼渐进可获得吉祥。进取得到正位，前往有功业。按正道前进，可以安邦定国。渐卦九五爻刚爻居中。能适可而止并且随顺，行动起来就不会走向穷途末路。", "象辞说：山上有树木，这就是渐卦的卦象。君子从卦象中得到启示，以贤德自居，改善民风杂俗。" ],
        [ "【启示】渐是前进的意思，但不是突飞猛进，而是等待、顺应时势变化的渐进，主吉象。事物不会总是停留在静止状态中，所以艮卦后面是渐卦。从卦象上看，山上生木。山中的森林不是突然形成的，树的缓慢生长就是渐的含义。从人事上看，尽管升卦也要积小为大，但毕竟处在无阻碍的时位，顺势而升；而渐卦则是有所等待而进。品德修养和风俗的改善都是一个渐进的过程，修己、化俗都不能一朝一夕即见成效，而要靠累积渐进。", "渐进是一种有次序的进，不越次序，因而缓慢。卦里借用女子出嫁来说明其中的道理。古代女子出嫁要行六礼：纳彩、问名、纳吉、纳征、请期、亲迎等六个步骤，必须严格按照这个程序去做。遵循了这六礼，这桩婚姻就是合理的，否则就是私奔。本卦如同女子出嫁那样，不能随便逾越任何一个步骤。", "得此卦，不应急进，急躁必有损失。好事慢慢在进行中，一切遵循正里常规即可，事业投资均能有收益。感情婚姻有欢喜结局，也有再娶或私奔之兆。求财虽可行，但有隔阻难成之象。" ]
      ],
      6:[ "【原文】象曰：小子之厉，义无咎也。", "【译文】象辞说：小雁的危险，从道义上讲不应该有灾难。", "【启示】渐卦取女子出嫁、鸿雁渐飞之象。初六软弱，不具备一飞冲天的条件，不适宜深进。传说伏羲取消了群婚制，改为对偶婚。并规定订婚时男方要给女方送一只大雁。这种习俗被沿袭下来，一直到单偶婚时代，改为男方向女方提婚时必须送礼。为什么送大雁？因为大雁是成双在一起，死掉一只，另一只终身不再成双。另外，大雁飞行时排成一行，非常有秩序，象征爱情的忠贞。" ],
      5:[ "【原文】象曰：饮食衎衎，不素饱也。", "【译文】象辞说：饮食和乐，不是白吃。（即自己找食物，自得其乐。）。", "【启示】六二，大雁又飞高了一层，不在水边了，来到了石头上。这象征君子渐渐长大。君子长大了，与家人一起欢乐地享受饮食之乐，饮食营养可以使君子的身体更茁壮地成长，怎么会不吉祥呢？当然，这里的饮食也包括道德与知识的吸取。" ],
      4:[ "【原文】象曰：夫征不复，离群丑也。妇孕不育，失其道也。利用御寇，顺相保也。", "【译文】象辞说：丈夫出征没有回来，是因为他离开了自己的同伴。妇女怀孕却流产了，是因为她失去了保胎的正道。利于抗击盗寇，是因为民众和顺相处共同保卫家园。", "【启示】九三叛离了自己的同类，行为失去了夫妇相亲之道，有凶险。不过却有利于防御强寇。九三刚亢躁进，不知回头是岸。九三与六四只是比的关系，却相比无间，露水苟合，私情相悦，要犯错误。九三叛离了同类，成为独夫，发展下去只能落得个被千夫所指的下场。如果能够谨慎，就会使强寇无所乘。" ],
      3:[ "【原文】象曰：或得其桷，顺以巽也。", "【译文】象辞说：飞落到屋顶上，说明六四柔顺而且随和。", "【启示】大雁在空中飞行，却难逃猎人的利箭。大雁为了不被野兽所伤，飞到大树上和屋顶上栖息。这是喻示贤臣可得到明君的保护。古代读书的儒生一直处于饥寒交迫中，可是不负十年寒窗苦，终于学有所成，成为国家的栋梁了，自然处境变好了。这里喻示人们要选择明君而仕，不要辅佐昏君。" ],
      2:[ "【原文】象曰：终莫之胜，吉；得所愿也。", "【译文】象辞说：最终没有人欺凌她，吉祥，是她最终的愿望能够实现（即与自己心慕的男人结合）。", "【启示】由于渐卦主要是要宣扬忠贞精神。所以把雌雁的忠贞事迹放到最重要的九五的位置。死去丈夫的雌雁飞到高高的山陵上躲避猎人的侵害，她三年都没有找过配偶。但是她虽然没有了丈夫的帮助，雁群中并没有人因她身单势孤而欺负她。" ],
      1:[ "【原文】象曰：其羽可用为仪，吉；不可乱也。", "【译文】象辞说：它的羽毛可作为礼仪饰品，吉祥，是说明礼仪是有一定顺序的，不能乱来。", "【启示】被射死的雄雁虽然没有了生命，但是人们敬佩大雁忠贞的行为，所以将它的羽毛制成礼仪的饰品，使他忠贞的精神得到永存。这就相当于因忠谏而被杀的贤臣，也相当于能与君王共存亡的忠义之士。他们虽然因为忠而失去了生命，但他们的精神是永存的。" ]
    },
    yunshisuduan: [
      "渐卦运势速断",
      "运势—逐渐顺利，光明开运之象。应打牢根基，循序渐进为吉。",
      "事业—欲速则不达。忌急躁冒进，应脚踏实地，小心谨慎，态度谦和。",
      "爱情—不可操之过急。慢慢交往、循序发展可成就良缘。也有再娶之象。",
      "疾病—此卦为“归魂卦”，常有耳鸣、心神涣散之象，应往东南方求医。",
      "经商—改行、开业吉，渐进有利，过急不利，不可盲目乐观或停步不前。",
      "诉讼—一波未平，一波又起。宜进不宜退，退则输，进则胜。",
      "出行—有消息将至，三人中有一人先去。",
      "人生—做事讲技巧，重名声。若有优秀的技术和创新，能获得声誉或权力。"
    ],
    chushizhidao: [
      "代表顺应变化，缓慢上升",
      "得此卦者有积善、积恶之分",
      "渐象征水慢慢浸透，有渐进的含意。从量变到质变的过程就是“渐”。得渐卦者，循序渐进才能水到渠成，遇事不可慌张，如果急躁则有损失。趋势存在于苗头中，好趋势应发扬，坏趋势应制止。"
    ]
  },
  58: {
    name: "第20卦 观：风地观卦",
    img: "20",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表凝视观察，透视原因",
      "得此卦者应施惠于人",
      "观卦表示在上者要体察下情才能得到拥戴、受到敬仰。观是“下仰瞻上”之意，别人要“观”我，而不是我要“观”别人。得观卦者要有所保留，停于雾里，示人以朦胧美，别让人一览无余。"
    ]
  },
  // 6
  61: {
    name: "第5卦 需：水天需卦",
    img: "5",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表寻求发展，遇到险阻",
      "得此卦者不可贪嗟来之食",
      "需象征需要，维生需要营养，遇事需要等机会。得需卦者如同禾苗需要雨水，这是事物的正常需要，只是暂时没有被满足。此时资源稀缺，不过，尽管只有一杯水，大家也都能润润嗓子。虽有险阻在前，终可因目的纯正而可成功。"
    ]
  },
  62: {
    name: "第60卦 节：水泽节卦",
    img: "60",
    guayao: [
      "节，亨。苦节不可贞。",
      "上六：苦节，贞凶，悔亡。",
      "九五：甘节，吉；往有尚。",
      "六四：安节，亨。",
      "六三：不节若，则嗟若，无咎。",
      "九二：不出门庭，凶。",
      "初九：不出户庭，无咎。"
    ],
    guayaoyi: [
      "节卦，亨通。苦苦节制不能够守正道。",
      "上六：过度苦苦节制，守正道凶险，但没有悔恨。",
      "九五：以节俭的生活为甜美，吉祥，前往会受到尊重。",
      "六四：安于节制，亨通。",
      "六三：不节制自己，就会哀叹悲伤，没有灾难。",
      "九二：不走出家门，凶险。",
      "初九：不走出房屋，没有灾难。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】节，亨。苦节不可贞。",
          "彖曰：节，亨，刚柔分，而刚得中。苦节不可贞，其道穷也。说以行险，当位以节，中正以通。天地节而四时成，节以制度，不伤财，不害民。",
          "象曰：泽上有水，节；君子以制数度，议德行。"
        ],
        [
          "【译文】节卦，亨通。苦苦节制不能够守正道。",
          "彖辞说：节卦亨通，是因为刚柔分工各得其所。苦苦节制不能够守正道，是因为这样会导致穷途末路。怀着喜悦迈过险境，恰到好处地进行节制，阳爻既居中又守正所以亨通。天地有所节制，于是形成了四季。用制度来节制，就可以达到不浪费财物，不祸害百姓的目的。",
          "象辞说：沼泽上面有水便是节卦的卦象。君子从卦象中得到启发，制定数量上的限制，讨论人的道德行为规范。"
        ],
        [
          "【启示】节的本意是竹节，竹子都分为数节，每一节都有适中的长度，所以节的引申义是节制、限制、节俭、衔接、关联。人的健康（节制）、人际关系（节操）、政策（节义）、天地变化（季节），一切都要遵守节才能顺利。所以象辞中对君子的告诫是：要掌握好分寸。比如，什么级别享受什么样的待遇，要有明文规定。不超过这个度，就是节俭，超过这个度，便是奢侈。",
          "从卦象上看，外卦坎为水，内卦兑为泽，泽上有水。水会由高至低流动，如果经过一个浅坑，水便会被积蓄而停止流动。沼泽比地面要低，可以蓄水。积水成泽便是节卦的大形象。节制是自然与人类社会共有的规律，刚柔相节，生成春夏秋冬四时，冬不能无限长，以春节制，夏也不能无限长，以秋来节制。",
          "比如洛克菲勒就是因为节省一滴焊锡而发展起来的。当时美国装石油用铁桶，而从石油注入铁桶一直到用焊锡封口都是由机械完成。洛克菲勒观察焊接这道工序，发现每次都可以节省一个焊点。于是他对机械进行改造，使焊每一桶都可以节省下一小滴焊锡。这个小发明给老板带来了很大的经济效益，洛克菲勒因此而受到了老板的重用。这是正确的节俭之道。",
          "得此卦者，应节制适中。于人于事，要有节度与分寸，适可而止。但若过于固执，又不近情理。应该明确自己的角色和定位，事业成功的重要条件是看首领人物是否使自己被量才使用。"
        ]
      ],
      6: [
        "【原文】象曰：不出户庭，知通塞也。",
        "【译文】象辞说：不走出房屋，是因为明白闭塞与通达的时势规律。",
        "【启示】节卦可以表达“节”的多种含义，如时节、裁节、品节、名节、符节、节制、节操等。如相对于时势来说，初九被九二所阻挡，所以他应当节制自己的言行，不可轻举妄动。初九懂得畅通则行，阻塞即止的节制之道。所以才有足不出户、以静制动的上策。自然没有咎害。"
      ],
      5: [
        "【原文】象曰：不出门庭，失时极也。",
        "【译文】象辞说：不走出家门，是失去时机到了极点。",
        "【启示】同样是不跨出家门，初九无咎，九二有凶。九二应有所作为，去大展宏图。但九二阳居阴位，过分节制，保守不出，所以有凶。比如鸿门宴上，范增多次示意项羽除掉刘邦，但项羽没有这样做，丧失了机会，最终落得乌江自刎的结局。"
      ],
      4: [
        "【原文】象曰：不节之嗟，又谁咎也。",
        "【译文】象辞说：因自己不节制导致悲伤，又能责怪谁呢？",
        "【启示】处于喜悦之中的六三会有喜悦过度的形象，乐极生悲，所以六三会哀叹悲伤。这就好比有个人，沉溺于娱乐中不能自拔，结果钱也花光了，还欠了不少债，所以到头来会心中悲伤。不过也没有什么大的灾难。"
      ],
      3: [
        "【原文】象曰：安节之亨，承上道也。",
        "【译文】象辞说：安于节制的亨通，是顺承九五的天道。",
        "【启示】处境比六三好得多。身为重臣，可以从君王那里得到很多好处。可是六四并不铺张浪费，而是像平时一样适度地过日子，当然会受到国君的器重，前景一片亨通。"
      ],
      2: [
        "【原文】象曰：甘节之吉，居位中也。",
        "【译文】象辞说：以节俭的生活为甜美的吉祥，是由于九五居中得位。",
        "【启示】节卦的卦主。适当节制而能够令人感到适中，身为尊贵之君，节以制度，不伤财不害民，以节天下国家，施之于己，也施之于人，可以获得吉祥。合乎规律的节制有利于事物发展。如果不节制，无限度地放纵自己，就必然会导致凶咎。"
      ],
      1: [
        "【原文】象曰：苦节贞凶，其道穷也。",
        "【译文】象辞说：过度节制的凶险，是因为穷途末路。",
        "【启示】上六处于极亢之位，节俭过了头，结局凶险。可是他并不为自己的凶险而感到后悔。这应该说是守财奴的通性，只要守住财，虽死无悔。好比守财奴被老虎咬住了，他的儿子来救他，弯弓搭箭正要射死老虎，结果这个守财奴却说：“我儿小心，不要伤了虎皮，否则就不值钱了。”"
      ]
    },
    yunshisuduan: [
      "节卦运势速断",
      "运势—状况卦，吉凶未定。有志不能伸，应和悦，并有节制。",
      "事业—不可冒进，应适当节制。节制必须有限度，过于节制会适得其反。",
      "爱情—多留意自己的言行举止，是否过份或放纵。男得此卦多有桃花。",
      "疾病—心脑血管、颈椎关节易出问题。病情有拖延之象，可往西北方求医。",
      "经商—改行、开业应缓，计划周详才可行。投资要有节制，适可而止。",
      "诉讼—应防女人。我方控诉对方，时间长了容易和解。",
      "出行—出行者还在路上，未归。未出行者宜静不宜动。",
      "人生—中意于仕途。人生呈阶段性特征，一段时间亨通，一段时间阻塞。"
    ],
    chushizhidao: [
      "代表节制限制，掌握分寸",
      "得此卦者难逃窘迫",
      "节指节俭、节制。节俭持家，节制做人，便可亨通。得节卦者，没有规矩难成方圆，有法度总比没有要好。然而时事在变，法度也在变，如果呆板迂腐，没有与时俱进的变通，便是自捆手脚、作茧自缚。"
    ]
  },
  63: {
    name: "第63卦 既济：水火既济卦",
    img: "63",
    guayao: [
      "既济，亨小，利贞，初吉终乱。",
      "上六：濡其首，厉。",
      "九五：东邻杀牛，不如西邻之褕祭，实受其福。",
      "六四：繻有衣袽，终日戒。",
      "九三：高宗伐鬼方，三年克之，小人勿用。",
      "六二：妇丧其髴，勿逐，七日得。",
      "初九：曳其轮，濡其尾，无咎。"
    ],
    guayaoyi: [
      "既济卦，小有亨通，利于守正道，起初吉祥最终混乱。",
      "上六：浸湿了头，有危险。",
      "九五：东邻杀牛进行祭祀，反而不如西邻的简单祭祀，实在而受到福佑。",
      "六四：像用布条缝补衣服一样，整日心怀戒备。",
      "九三：商朝的武丁高宗征讨鬼方国，用三年时间将其征服，小人不可用。",
      "六二：妇人丢失了首饰，不用寻找，七天后就会失而复得。",
      "初九：拖着车轮，沾湿了车尾，没有灾难。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】既济，亨小，利贞，初吉终乱。",
          "彖曰：既济，亨，小者亨也。利贞，刚柔正而位当也。初吉，柔得中也。终止则乱，其道穷也。",
          "象曰：水在火上，既济；君子以思患而豫防之。"
        ],
        [
          "【译文】既济卦，小有亨通，利于守正道，起初吉祥最终混乱。",
          "彖辞说：既济卦的亨通，是小人的亨通。利于守正道，是因为九五与六二刚柔得中而得位。起初吉祥，是因为六二柔爻居中位。终止则会混乱，说明天道已到了穷途末路。",
          "象辞说：水在火上便是既济卦的卦象。君子从卦象中得到启示，要考虑到隐患，做到未雨绸缪。"
        ],
        [
          "【启示】既是成功、完成；济是渡河。既济是成功渡过的意思。将细节之事做得完美就会成就大事，所以小过卦的后面是既济卦。既济卦与乾卦似乎有某种联系，从乾卦开始的人生奋斗经历了六十余卦的变化发展，进入大功告成的既济境界。既济卦是六十四卦中最完美的一卦：一、卦爻的排列方式完全符合阳奇阴偶的规则，各爻均在正位，且相互正应，这是最理想的形态；二、卦中各爻都有相应相合者，没有一个爻处于孤立之中；三、从卦象上看，外卦为水，内卦为火，坎水润下，离火炎上，水与火相交相合，互相补救，处于平衡状态。",
          "比如治国，高明的君王总是奸臣与忠诚并用，这便是水与火的平衡。比如乾隆既任用纪晓岚、刘墉，又任用何珅；慈禧太后既任用洋务派大臣，又任用保守派大臣……这是统治者的统御之道。只有忠臣，忠臣逐着权势加大也会变成妄为；只有奸臣，更会使局面动荡混乱。以忠臣克制奸臣，以奸臣制约忠臣，是最高明的统治之道。由此可以看出水火相交是多么重要。",
          "既济是万物经过变化达到阴阳平衡的局面，代表大功告成。但既济只是人生的一个驿站，而不是终点。物极必反，成功后容易陷入懈怠、混乱，所以守成更为艰难。此时不要进行新事业，维持现状最重要。一旦平衡局面被打破，出现新的矛盾，新的过程又将开始，既济也就又转为未济。所以居安思危、慎终如始是既济卦的核心思想。",
          "得此卦时，不懈怠则可保吉祥，若气盛骄傲则有凶。求财，似成而不成。预测婚姻，应缓慢发展。"
        ]
      ],
      6: [
        "【原文】象曰：曳其轮，义无咎也。",
        "【译文】象辞说：拉着车轮，道义上不会有灾难。",
        "【启示】初九一切皆亨，就忘了居安思危、慎终如始的道理。比如有人立功受奖了，在荣誉面前感到很骄傲。这很可能使你停滞不前，甚至是退步。所以在荣誉面前一定要更加谨慎，从严要求自己。可这不是一般人能做到的，历史上更多的人是无法逃脱在巨大的成就面前人格变态的命运。"
      ],
      5: [
        "【原文】象曰：七日得，以中道也。",
        "【译文】象辞说：七日后便会失而复得，是因为六二爻能守中庸之道。",
        "【启示】本有建功立业之志，但处在既济之时，不可妄动，应维护局势的稳定。这样就失去了施展才干的机遇，心里不痛快，好在六二柔顺中正，用极大的毅力来克制自己。以大局为重。危境多机遇，盛世有遗贤。只要六二能坚持中正之道，机遇终将会到来。"
      ],
      4: [
        "【原文】象曰：三年克之，惫也。",
        "【译文】象辞说：三年才把对方征服，是太疲惫了。",
        "【启示】战斗艰苦卓绝，胜利来之不易。创业难守成更难，胜利之后，在既济的形势下管理国事也不容易，要面临一个新问题：怎样对待小人？战乱之时，小人也能顺势立功。但小人焦躁激进，若任用小人管理国家，必致危乱。此时，对待小人宁可给以重赏，不可给以重用。"
      ],
      3: [
        "【原文】象曰：终日戒，有所疑也。",
        "【译文】象辞说：整日心怀戒备，是因为有所疑虑。",
        "【启示】既济以内卦为主，至外卦则开始向未济方向转化，六四居外卦之始，将要变化但尚未变化。不过六四有很深的哲学素养，六四居多惧之处，有所疑虑，居安思危，终日戒惧，以防患于未然。表面看来，既济之时各种矛盾均已解决，实际上此时只是旧有矛盾止息了，新的矛盾正在酝酿，所以君子无论是处在事未成之时还是已成之时，都不应有瞬息的懈怠。"
      ],
      2: [
        "【原文】象曰：东邻杀牛，不如西邻之时也；实受其福，吉大来也。",
        "【译文】象辞说：东邻杀牛进行祭祀，不如西邻按时献祭虔诚。实在而受到福佑，所以吉祥会源源不断涌来。",
        "【启示】事成物盛，此时最易生骄奢之心而失诚敬之意。君王应当“垂裳而治”，做到“无为而无不为”。纣王用杀牛来祭祀先祖与天神，虽然隆重但却没有得到福佑；周朝只用简单的祭品献祭反而得到了福佑，结果周朝灭掉了商王朝而成为天子之国。原因是纣王不按时祭祀，而周朝则按时祭祀有诚信。言外之意是保持现状不要有所变动。"
      ],
      1: [
        "【原文】象曰：濡其首厉，何可久也。",
        "【译文】象辞说：浸湿头的危险，生命怎么会长久呢？",
        "【启示】完美的极至是缺损的开始。既济卦是最完美的，所以每一爻都含有保持、延迟这种完美的意思。可是到了上六则没有这个意思了。因为万事万物的变化规律是不以人的意志为转移的，人可以延缓完美的早衰，却无法使完美不衰退。上六本质柔弱，有危厉，如果警钟要长鸣、慎终要如始，危机是可以挽救的。"
      ]
    },
    yunshisuduan: [
      "既济卦运势速断",
      "运势—吉中带凶之象。百事有成，应保持初吉之成果，退守为吉，骄惰为凶。",
      "事业—大功已成。保住这种势头是关键。盛极将衰，应思患预防，防微杜渐。",
      "爱情—初时多为出双入对，形影不离，久后则易生变，甚至离散。",
      "疾病—阴入阳体，相互抗衡，日轻夜重，需尽快处理。可往西北方求医。",
      "经商—改行、开业不利。虽然形势有利，收益较多，但危机可能随时出现。",
      "诉讼—有小人侵犯，但最终不过是一场虚惊。",
      "出行—宜出行但不宜求财，往东北方有利，宜与人同行。",
      "人生—年轻时灿烂辉煌，晚年孤独寂寞。财富机遇好坏参半。"
    ],
    chushizhidao: [
      "代表成功渡过，大功告成",
      "得此卦者维持现状最重要",
      "既济指渡河成功。得既济卦者处于完美状态中，但完美也是句号，是谢幕时的掌声。现在到了该料理后事的时候，应该留下一份总结。不过，物极必反，完美时容易陷入懈怠、混乱，所以说守成比创业更难。"
    ]
  },
  64: {
    name: "第3卦 屯：水雷屯卦",
    img: "3",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表脆弱，因阻力而停滞",
      "得此卦者要重视远处之害",
      "屯象征创业的艰难，如同草木刚刚破土，不能利用。但长势不可逆转，坚定信念则前程无量。得屯卦者，如同初生的稚嫩之躯，最怕受伤害，同时也最易受伤害。惹不起但躲得起，为了前途最好忍气吞声，先求保全，积聚力量。"
    ]
  },
  65: {
    name: "第48卦 井：水风井卦",
    img: "48",
    guayao: [
      "井，改邑不改井，无丧无得。往来井井。汔至，亦未繘井，羸其瓶，凶。",
      "上六：井收勿幕，有孚无吉。",
      "九五：井冽，寒泉食。",
      "六四：井甃，无咎。",
      "九三：井渫不食，为我心恻，可用汲，王明，并受其福。",
      "九二：井谷射鲋，瓮敝漏。",
      "初六：井泥不食，旧井无禽。"
    ],
    guayaoyi: [
      "井卦，城邑可以迁移，井却迁不走。没有丧失，也没有获得。人们来来往往到井边打水，提水未到井上的时候，陶罐挂住被井壁碰碎，凶险。",
      "上六：井口建成后，不加盖，有诚信大吉祥。",
      "九五：井水清澈，清凉的泉水众人饮用。",
      "六四：砌好井壁，没有灾难。",
      "九三：井已清理干净而没有前来饮水，使我感到伤心。可以来提水了，君王贤明，人们会一同受益。",
      "九二：投射井中的小鱼，结果水罐被碰破而漏水。",
      "初六：井底的污泥不能食用，废旧的井水污浊，禽兽也不来饮水。"
    ],
    guaciyaoci: {
      0: [
        [
          "【原文】井，改邑不改井，无丧无得。往来井井。汔至，亦未繘井，羸其瓶，凶。",
          "彖曰：巽乎水而上水，井。井养而不穷也。改邑不改井，乃以刚中也。汔至亦未繘井，未有功也。羸其瓶，是以凶也。",
          "象曰：木上有水，井；君子以劳民劝相。"
        ],
        [
          "【译文】井卦，城邑可以迁移，井却迁不走。没有丧失，也没有获得。人们来来往往到井边打水，提水未到井上的时候，陶罐挂住被井壁碰碎，凶险。",
          "彖辞说：进入到里面可能提上水来，就是井。井中的水永远提不完。城邑可以迁移，井却无法迁移，是因为刚爻居中的缘故。提水未到井上的时候，陶罐被挂住，是还没有成功。井壁碰碎了陶罐，所以凶险。",
          "象辞说：木上有水便是井卦的卦象。君子从中受到启示，告诉劳作的民众要学会互相帮助。"
        ],
        [
          "【启示】井指的就是水井。以井喻君子，以井水喻美德。在困境中会力不从心、视野受限，变得保守，这是井卦的含义。所以困卦之后是井卦。井有节俭之意，节水备养，犹如节财备用。井通刑字，有含忧、刑戮、小通大滞之意。井水虽不能种植、畜养，却能养人度日。他取之不尽，经久不竭，永远干净，可自由汲取，象征君子的美德。君子要像井水浇灌田地一样，源源不断地以美德教育民众，让民众懂得团结、互相帮助。但打水需要水桶，否则井水会空自腐坏。水桶可能倾覆，所以平静中暗藏着凶险。另外，井不能移动，要永远守在原地。在井水已汲到接近井口，将要出井时，如果汲水的瓶罐坏了，就会一无所获，必有凶险。同理，人如果不能善始善终，一定会导致凶咎。水井如果只为个人独用而不养大家，这是水井的悲哀。汲用井水的人越多，水井施泽的范围就越广。应该相信井水是源出不穷的，永远流不完。只有这样，水井养人的功用才可发扬光大。",
          "摇得井卦，对人而言，表示心力有限，不能做太大的计划。也表示视野受限，保守心态重。但格局小能过活，主小吉象。忌公事诉讼。有思不定、居所有虚惊之意。预测婚姻有分开再合之象，应迟。"
        ]
      ],
      6: [
        "【原文】象曰：井泥不食，下也。旧井无禽，时舍也。",
        "【译文】象辞说：井中的污泥不能食用，是因为位置在最下面。废旧的井边没有野兽，是因为井随着时间的推移被舍弃了。",
        "【启示】井底有污泥沉滞，井水污浊不能汲食，再加上久不修治已成为旧废之井，连鸟雀都不光顾了。一旦人们不来汲水饮用，水井就变成无用之物。如果清理完还不能用，只能重新再打一口井。旧井的水污浊，连禽兽也懂得那里的水不能喝。这喻示道德纯净的人，才会使更多的人与他交往，因为人们能从他的言行中获得益处。"
      ],
      5: [
        "【原文】象曰：井谷射鲋，无与也。",
        "【译文】象辞说：用水罐投射井中的小鱼，不会有收获。",
        "【启示】爻辞认为，不要因小失大，占小便宜吃大亏。比如有些员工上班就是想挣钱养家。可是渐渐的，他忘记了自己这个目的。发现单位里管理不严格，便经常从单位里往外偷东西。结果被单位领导发现，不但受到了法律的制裁，而且也失去了工作。"
      ],
      4: [
        "【原文】象曰：井渫不食，行恻也。求王明，受福也。",
        "【译文】象辞说：井已清理而不来提水，这种行为使人悲伤。祈求君王贤明，是为了接受他的福泽。",
        "【启示】九三就好比一口刚刚清理过的井，本来很洁净了，可是人们却认为他仍然是脏的，尤其是君王也认为是这样，那这个被冤屈的九三是够痛苦的。千里马必须有伯乐的赏识才行，有才之人不遇圣明君王也就不能发挥其作用。"
      ],
      3: [
        "【原文】象曰：井甃无咎，修井也。",
        "【译文】象辞说：砌好井壁没有灾难，是修井带来的好处。",
        "【启示】六四不会有屈原一样的灾难。古代的井有用砖砌的，也有不用砖砌的。用砖砌井壁可以使井壁的土与水隔离开来。这样井水就更清洁了。这其实是说，六四的言行表现出对君王的忠诚，君王很容易了解到他是多么忠于君王，所以自然会得到君王的信任与宠爱，这怎么会有灾难呢？"
      ],
      2: [
        "【原文】象曰：寒泉之食，中正也。",
        "【译文】象辞说：清凉的泉水众人饮用，是因为九五居中而得位。",
        "【启示】九五是一位贤明的君王，他可以给臣民带来源源不尽的好处。这位九五君王就像清澈的井水，源源不断地把甘甜清凉的水奉献给大家。井水的清，喻示的是君王执政的清明公正。一个国家，如果君王英明，群臣就会秉公执法，这样天下就可以得到大治了。"
      ],
      1: [
        "【原文】象曰：元吉在上，大成也。",
        "【译文】象辞说：大吉祥于上位，是大功告成的意思。",
        "【启示】此时井水会源出不穷，无时不可取水为用，好得不能再好。六十四卦大多数到卦终时都向相反的方向转化，但这不是绝对的。井卦相当特别，以上爻为用，越往上越好。上六代表井水已经汲上来了，是大功告成之时。这象征君王要广纳天下忠言，才能使天下大治。比如尧帝在位时，大臣每天都称颂国泰民安。对此，帝尧十分不安。为了听到真实的情况，他命人制作一面大鼓放在宫殿门外，并发布公告，让天下人都可以来这里击鼓进谏，任何人不得阻拦。由于他能诚心诚意地接受别人的意见，终于使天下大治。"
      ]
    },
    yunshisuduan: [
      "井卦运势速断",
      "运势—井为静而不能移之物。难以进取，缺乏冲劲，不如守之泰然。",
      "事业—处境平稳。不应贸然前进或后退，应真诚奉献，充实个人实力。",
      "爱情—情况不妙，有破裂或分而再合之象，不必过急，应慢慢发展。",
      "疾病—病在肾、膀胱等泌尿生殖器官。多为旧病复发。宜往西方求医。",
      "经商—有破损之象。利于守业、小交易，但不可大作为或改行。",
      "诉讼—因田土之事而纷争，不可贸然发动攻势。",
      "出行—动则不远，远则必然难动，近则有利。若寻人，暂无音信。",
      "人生—性格安静、警惕。适合在家乡发展，离开家乡则事业难成。"
    ],
    chushizhidao: [
      "代表力不从心，变得保守",
      "得此卦者应独善己身",
      "井水永远干净，象征美德。但打水的水桶可能倾覆，所以平静中暗藏着凶险。得井卦者如同井水一样，不枯不竭，不满不溢；不通江河，却是活水；所求不多，只想持平；与世无争，没有风波。"
    ]
  },
  66: {
    name: "第29卦 坎：坎为水卦",
    img: "29",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表险中有险，困上加困",
      "得此卦者步步当心陷阱",
      "坎是坎坷、陷入困境，在失落之中不可改变自己的信念。得坎卦者大都处于险难中，明枪易躲暗箭难防，如果前面有陷阱，与其抢一秒，不如停三分。不可害人，但要防人，尽管阴谋防不胜防，但身正不怕影子斜。"
    ]
  },
  67: {
    name: "第39卦 蹇：水山蹇卦",
    img: "39",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表跛足行走，面临困难",
      "得此卦者求人艰难",
      "蹇指瘸腿，走路困难。得蹇卦者如同跛脚之人难以走远路，进退两难，不可能亨通，只有遇到相助的人才能继续前进。事情往往坏在行为的不协调上，这会留下太多遗憾。"
    ]
  },
  68: {
    name: "第8卦 比：水地比卦",
    img: "8",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表亲附他人，宜速不宜缓",
      "得此卦者不宜结成朋党",
      "比象征相亲相爱，和睦相处，但如果看到别人团结，心里不安才去团结则有凶险。得比卦者可能有两种情况：朋比、党附。前者基于情性，后者基于利益；前者生狎昵，后者酿党争。自己属于哪种情况需要具体分析。"
    ]
  },
  // 7
  71: {
    name: "第26卦 大畜：山天大畜卦",
    img: "26",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表积蓄包容，有大丰收",
      "得此卦者最贵慈悲心",
      "大畜象征家有大的积蓄，只要找到明路必然发达。得大畜卦者，占据天时就会有大的积蓄。此时要适可而止，不可贪恋二尺硬土、乘势向外扩张。运作事情要有城府，保守机密，否则不容易成事。"
    ]
  },
  72: {
    name: "第41卦 损：山泽损卦",
    img: "41",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表减损自己，增益他人",
      "得此卦者别追求完美",
      "损就是损失，为了根本利益需要做出牺牲，这样大家都能得利。得损卦者，善吃小亏则将占大便宜。比如植树，如果没有适时地砍掉多余的小树，便不利于其他树的生长，不能在总体上促进树林的壮大。"
    ]
  },
  73: {
    name: "第22卦 贲：山火贲卦",
    img: "22",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表装饰修饰，文教礼制",
      "得此卦者要掩藏不足",
      "贲表示装饰事物，使人赏心悦目，但如果过份则适得其反。得贲卦者要懂得自我修饰，隐蔽缺陷。因为距离产生美，美在朦胧中。无论出于何种目的，装饰都是一种修养。不懂得装饰自己就是自我贬低。"
    ]
  },
  74: {
    name: "第27卦 颐：山雷颐卦",
    img: "27",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表注重养生，言语节制",
      "得此卦者应加强修养",
      "颐象征保养，保养身体才能得到健康，休整之后才能健康发展。得颐卦者要懂得正确的养生之道，这包括饮食、语言两个方面。饮食、言语都要有节制，适可而止，吃饭要八分饱，说话前要三思。"
    ]
  },
  75: {
    name: "第18卦 蛊：山风蛊卦",
    img: "18",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表积弊已久，坏到极点",
      "得此卦者不可昏然混日子",
      "蛊象征衰败时有新力量诞生，并最终使混乱的局面归于平静，此时利于建立新的功业。得蛊卦者往往是祸起萧墙，机构内部出了严重的问题，善始而难善终。此时应大刀阔斧，将革命进行到底，推翻了重来，开辟新天地。"
    ]
  },
  76: {
    name: "第4卦 蒙：山水蒙卦",
    img: "4",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表蒙昧时期，需要教育",
      "得此卦者应择师友",
      "蒙象征幼稚者需要启蒙，但必须动机纯正。得蒙卦者容易猜疑，猜疑生于不自信。要明白“疑人不用，用人不疑”。蒙也代表启蒙教育，璞玉待雕，当求良工巨匠；孟母择邻，为了远墨近朱。教不严师之惰，为尊长者要感受到社会责任。"
    ]
  },
  77: {
    name: "第52卦 艮：艮为山卦",
    img: "52",
    guayao: ["艮，艮其背，不获其身，行其庭，不见其人，无咎。", "上九：敦艮，吉。", "六五：艮其辅，言有序，悔亡。", "六四：艮其身，无咎。", "九三：艮其限，列其夤，厉薰心。", "六二：艮其腓，不拯其随，其心不快。", "初六：艮其趾，无咎，利永贞。"],
    guayaoyi: ["艮卦，停在他的背后看不到他的前身，走进他的庭院，却看不到他本人，没有灾难。", "上九：敦厚而懂得适可而止，吉祥。", "六五：止住牙床，说话有次序，没有悔恨。", "六四：止住上身，没有灾难。", "九三：止住腰部，撕裂脊背，危险如烈火烧心。", "六二：抑制小腿，不能快步跟随别人，心中不高兴。", "初六：脚趾停止运动，没有灾难，利于永远守正道。"],
    guaciyaoci: {
      0: [
        [ "【原文】艮，艮其背，不获其身，行其庭，不见其人，无咎。", "彖曰：艮，止也。时止则止，时行则行，动静不失其时，其道光明。艮其止，止其所也。上下敌应，不相与也。是以不获其身。行其庭不见其人，无咎也。", "象曰：兼山，艮；君子以思不出其位。" ],
        [ "【译文】艮卦，停在他的背后看不到他的前身，走进他的庭院，却看不到他本人，没有灾难。", "彖辞说：艮，即止的意思。该停止的时候便停止，该行动时就行动，行动与静止不失时机，这样道路才会光明。艮卦是讲停止的道理的，所以该抑止的行为必须抑止。艮卦上下卦的对应爻相互敌对，而不是相互亲近呼应。所以说不能获得其身。在他的庭院行走却看不到他本人，所以没有灾难。", "象辞说：两山相重就是艮卦的卦象。君子因此考虑问题不能超过自己的位置。" ],
        [ "【启示】艮是停止、退守的意思。事物不可能总是处于震动的状态中，总有停止下来的时候，所以震卦的后面是艮卦。在六十四卦中，两雷、两风、两水、两火、两泽都有互相交应的可能，惟独两山对峙，不可能有任何往来，谁都不作迁就，互不相涉，有抑止、受阻的含义。", "卦辞认为，人要止于心无外求，也就是自我控制，抑制自己不良的欲望。而不是靠外力来制止。事当做则做，不当做则不做，做就要善始善终；话当讲则讲，不当讲则不讲，讲就要言之有序。控制言行要“思不出其位”，思想上要加强修养，经常反躬修己。", "艮卦中的静止是相对的。比如两军对峙，准备开战，其中一方觉得自己没有取胜的把握，便退到城里，进入静止的状态。可是回到城里的将士不可能什么也不做，而是想计策的想计策，练兵的练兵，逃跑的逃跑。所以说静止是相对的。此时要掌握好动静的时机，该止则止，不超越一步。", "得此卦者，维持现在的地位、境遇最重要。应沉默思考，安份守常，不可轻举妄动，所思所虑不超出本位。冒进会招致接连的灾难，且难有协助者。此卦又有忧喜相叠之意，半调半难调。又有人合背站立之象，彼此独立而不能相助。求财则似成而不成，有危难损财，但也有外部救援，可逐渐转吉。预测婚姻似有成，但对峙双方有不通之势，有单恋或不被接受之象。若能保守面对、修身养性则安，适时休息方能平安度过。" ]
      ],
      6:[ "【原文】象曰：艮其趾，未失正也。", "【译文】象辞说：脚趾停止运动，是没有失去正道。", "【启示】止于其趾。脚趾处人体之下，人要行动则趾先动，而初六在尚未开始行动时就予以抑止，知不可为，则开始就不为之。止有两种情况：止于行和止于止。应当做的事开始就要坚决去做，不应当做的事开始就坚决不去做。这样才不会招致咎害。抑止不正当的行为一定要早，力争抑止于尚未萌发之时，一旦行为产生再去制止，会事倍功半。" ],
      5:[ "【原文】象曰：不拯其随，未退听也。", "【译文】象辞说：不能快步跟随别人，也没有听从后退停止的命令（所以不高兴）。", "【启示】六二的品德使他在危险中能够自我约束，所以不会有大的灾难。只是由于必须对自己严格约束才能脱离危险，所以自己的内心会感到有些压抑。比如文革中被关进牛棚的老一辈革命家就处于六二这种困境中。不能多说，只能违心而说，坚持正义就会带来灾难。所以“其心不快”。" ],
      4:[ "【原文】象曰：艮其限，危薰心也。", "【译文】象辞说：止住腰部，其危险如烈火烧心一样。", "【启示】抑止要合乎时宜，不可随便抑止，否则止于君臣则君臣失调，止于家庭则妻离子散，止于朋友则朋友失义。九三的静止不是自觉的静止，而是被困的静止。九三有动的形象。困于危险中而运动，肯定不会有好的结果。比如在文革中，有些人被关在牛棚里还是想要为自己讨个公道，想要伸张正义，结果使自己受到了更大的灾难。" ],
      3:[ "【原文】象曰：艮其身，止诸躬也。", "【译文】象辞说：止住上身，便止住了全身。", "【启示】六四发现自己处于危险的境地，便开始严格要求自己，不乱说不乱动，又具有柔顺之德，所以不会有灾难。六四可以受到九三的帮助而免于灾难。并且他也能从九三身上吸取教训，从而严格约束自己，所以他的格外谨慎使他“无咎”。" ],
      2:[ "【原文】象曰：艮其辅，以中正也。", "【译文】象辞说：止住牙床，是因为六五能居中守正。", "【启示】六五是一卦中最重要的位置，所以也把人最应该静止的部位放在了这里。人最应该静止的部位便是嘴。“病从口入，祸从口出”，信口胡说，会给自己带来灾难。贤明的君王一般是不会提拔伶牙俐齿的人为重臣的。汉朝大臣张释说：“有道德和真才实学的人不会夸夸其谈。越是有德的人，越是器宇深沉，言语简当。”" ],
      1:[ "【原文】象曰：敦艮之吉，以厚终也。", "【译文】象辞说：敦厚而懂得适可而止的吉祥，是因为以敦厚而得善终。", "【启示】“大智若愚”是智的最高境界。上九便是这种境界。以敦厚的态度停止，这是表面上最大的停止。这种停止不是什么都不做，而是类似于老庄的清静无为。这就是无为而无不为，表面上没有做什么，但实际上已经成就了一切。" ]
    },
    yunshisuduan: [
      "艮卦运势速断",
      "运势—六冲卦，大好大坏之象。百事有阻，应知退，量力而为。",
      "事业—不可依赖，应进行调整，停止行动。强行逞能为凶。",
      "爱情—有对峙、单恋、难合之势，双方各有阻挠，关系停滞不前。",
      "疾病—多为鼻、口、动脉硬化、胃胆之疾。难治。应往东北方求医。",
      "经商—改行、开业不吉。应安静退守，不受外界干扰，静待时机。",
      "诉讼—可能有姓张的人从中作梗，慎防。",
      "出行—去不成，若去则有险。",
      "人生—清高孤傲、适合艺术行业。年轻时有为，中晚年退隐思想严重。"
    ],
    chushizhidao: [
      "代表两山对峙，互不干涉",
      "得此卦者不可越雷池半步",
      "艮象征稳重、静止。得艮卦者，最突出的特点是“稳”，稳定如山，静止不动，恒久不变，相当有定力。此时要当止则止，所思所虑不超出本位，不超越一步，不轻举妄动，如果冒进会招致接连的灾难。"
    ]
  },
  78: {
    name: "第23卦 剥：山地剥卦",
    img: "23",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表走向衰落，即将崩溃",
      "得此卦者应以静制动",
      "剥就是剥落，小人得势，君子失势，如同墙面被逐层剥落。得剥卦者，衰势已成，不可逆转，放弃是种明智的选择。但此处的山穷水尽并不影响日后的柳暗花明，要积蓄力量，等待机遇。等来日重整旗鼓，改弦更张。"
    ]
  },
  // 8
  81: {
    name: "第11卦 泰：地天泰卦",
    img: "11",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表通泰无滞，君子占上风",
      "得此卦者应维持现状",
      "泰象征万事如意，无论干什么事都会亨通。得泰卦者安如泰山，大吉大利，事半功倍。然而泰极则否至，要想持盈保泰，应有危机意识、忧患意识，修德进业，让泰的状态尽量得到延长。"
    ]
  },
  82: {
    name: "第19卦 临：地泽临卦",
    img: "19",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表亲近下属，经常巡视",
      "得此卦者要为众人谋利",
      "临卦表示如果有愿望就可以实现。得临卦者在思想上容易给自己设置边界，善守成，不善开拓。应抓住时机，以霹雳手段占据主动地位。居高临下，积极给予，以高尚的人格来感召，以威信维持纪律。"
    ]
  },
  83: {
    name: "第36卦 明夷：地火明夷卦",
    img: "36",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表光明熄灭，小人得势",
      "得此卦者要韬光养晦",
      "明夷表示坏到极点，曙光就在眼前，只需要最后坚持一下。得明夷卦者最好低调些，不显山不露水。保护好自己，如果为了做事而伤了自己，天大的本事也无法再施展出来。"
    ]
  },
  84: {
    name: "第24卦 复：地雷复卦",
    img: "24",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表出现生机，利于行动",
      "得此卦者应该进取",
      "复象征万物在轮回中不断反复，生机勃勃，也象征生命复始，有利于做事。得复卦者如同大病初愈，身体虚弱但又在凋零中充满生机，百废待兴，此时是施展才能的好时候。但欲速则不达，不可操之过急，养足元气才可行动。"
    ]
  },
  85: {
    name: "第46卦 升：地风升卦",
    img: "46",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表顺畅无忧，蓬勃向上",
      "得此卦者可创新高",
      "升指上升。得升卦者乘势而上可以图谋发展，应利用良好的机遇将志向行于天下。丑小鸭此时已经变成白天鹅，但要记住自己曾经是鸭类。造成陈胜起义失败的因素之一就是他怕儿时的伙伴说他年轻时为人佣耕。"
    ]
  },
  86: {
    name: "第7卦 师：地水师卦",
    img: "7",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表战争忧患，强烈抗争",
      "得此卦者不可成为乌合之众",
      "师象征在柔顺的外表下埋伏着凶险与机遇，看你如何选择。得师卦者，因众成势，但有隐忧。因为与聚众相比，服众更难。驾驭众人时，正则使之浑然一体，可成大业；邪则为乌合之众，一旦失控则为害惨烈。"
    ]
  },
  87: {
    name: "第15卦 谦：地山谦卦",
    img: "15",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表谦虚谨慎，甘居人后",
      "得此卦者不可失去自尊",
      "谦就是谦虚，可以亨通，即使开始困难，最终也会受到赏识。得谦卦者，谦虚则有百利而无一害。谦之精义在于“敬”，敬人要戒势利，敬业要戒懈怠，敬物要戒奢侈。谦而不媚不傲，万事皆可成。"
    ]
  },
  88: {
    name: "第2卦 坤：坤为地卦",
    img: "2",
    guayao: ["", "", "", "", "", "", ""],
    guayaoyi: ["", "", "", "", "", "", ""],
    guaciyaoci: {
      0: [
        ,
        ,
        
      ],
      6:,
      5:,
      4:,
      3:,
      2:,
      1:
    },
    yunshisuduan: ,
    chushizhidao: [
      "代表宽厚包容，消极被动",
      "得此卦者不可独立创业",
      "坤象征大地，可以包容、滋生万物。得坤卦者，应当收敛，谨行慎言才无过失。不可做鸡头，应该做牛尾，耐住寂寞，寻找明主，等待时机。不着痕迹地服从领导可成就大功。一旦成势便具载舟覆舟之力。没有知遇的机会便一事无成。"
    ]
  }
};

export function sortList(property) {
  return function(a, b) {
    var value1 = a[property];
    var value2 = b[property];
    return value1 - value2;
  };
}
